# Product: HYPR_MFA
# Category: Security SSO
# Supported Format: CSV
# Reference: N/A
# Last Updated: 2024-04-26
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "principal" => ""
      "target" => ""
      "metadata" => ""
      "security_result" => ""
      "device_id" => ""
      "sc_action" => ""
      "principal_platform" => ""
      "principal_ip" => ""
    }
  }

  mutate {
    gsub => ["message","NO ENTRY",""]
  }

  csv {
    source => "message"
    on_error => "not_csv"
  }

  mutate {
    rename => {
      "column1" => "ADDITIONALDETAILS"
      "column2" => "AUTHENTICATOR"
      "column3" => "COMPANION"
      "column4" => "DEFAULT_VALUES_LIST"
      "column5" => "DEVICEID"
      "column6" => "DEVICEMODEL"
      "column7" => "DEVICEOS"
      "column8" => "DEVICEOSVERSION"
      "column9" => "DEVICERELVERSION"
      "column10" => "DEVICETYPE"
      "column11" => "ERRORCODE"
      "column12" => "ERRORSEVERITY"
      "column13" => "EVENTLOGGEDBY"
      "column14" => "EVENTNAME"
      "column15" => "EVENTTIMEINUTC"
      "column16" => "FIDOUSER"
      "column17" => "ID"
      "column18" => "INTEGRATIONPROVIDER"
      "column19" => "INTEGRATIONTYPE"
      "column20" => "ISSUCCESSFUL"
      "column21" => "LOGGEDTIMEINUTC"
      "column22" => "MACHINEDOMAIN"
      "column23" => "MACHINEID"
      "column24" => "MACHINENAME"
      "column25" => "MACHINEUSERNAME"
      "column26" => "MESSAGE"
      "column27" => "ORIGIN"
      "column28" => "REMOTEIP"
      "column29" => "RPAPPID"
      "column30" => "SDKRELVERSION"
      "column31" => "SERVERRELVERSION"
      "column32" => "SESSIONID"
      "column33" => "SUBNAME"
      "column34" => "TENANTID"
      "column35" => "TRACEID"
      "column36" => "TYPE"
      "column37" => "USAGETYPE"
      "column38" => "USERAGENT"
      "column39" => "VERSION"
      "column40" => "WSMODEL"
      "column41" => "WSOS"
      "column42" => "WSOSVERSION"
      "column43" => "WSRELVERSION"
    }
  }

  date {
    match => ["EVENTTIMEINUTC","yyyy-MM-dd HH:mm:ss.SS"]
    on_error => "time_mismatch"
  }

  mutate {
    replace => {
      "metadata.product_event_type" => "%{EVENTNAME}"
    }
    on_error => "no_EVENTNAME"
  }

  mutate {
    replace => {
      "metadata.product_log_id" => "%{ID}"
    }
    on_error => "no_ID"
  }

  mutate {
    replace => {
      "target.user.userid" => "%{FIDOUSER}"
    }
    on_error => "no_user"
  }

  mutate {
    replace => {
      "target.user.user_display_name" => "%{MACHINEUSERNAME}"
    }
    on_error => "no_MACHINEUSERNAME"
  }

  mutate {
    replace => {
      "principal.hostname" => "%{COMPANION}"
      "principal.asset.hostname" => "%{COMPANION}"
    }
    on_error => "no_host"
  }

  if [no_host] {
    mutate {
      replace => {
        "principal.hostname" => "%{MACHINEDOMAIN}"
        "principal.asset.hostname" => "%{MACHINEDOMAIN}"
      }
      on_error => "no_MACHINEDOMAIN"
    }
  }

  mutate {
    replace => {
      "principal_ip" => "%{REMOTEIP}"
    }
    on_error => "no_ip"
  }

  if [principal_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "principal_ip"
        "principal.asset.ip" => "principal_ip"
      }
      on_error => "no_principal_ip"
    }
  }

  mutate {
    replace => {
      "device_id" => "%{DEVICEID}"
    }
    on_error => "no_device"
  }

  if [device_id] not in ["", "NO ENTRY"] {
    mutate {
      replace => {
        "principal.asset_id" => "ID:%{device_id}"
      }
      on_error => "no_device_id"
    }
  }

  mutate {
    replace => {
      "hardware.model" => "%{DEVICEMODEL}"
    }
    on_error => "no_device_model"
  }

  if ![no_device_model] {
    mutate {
      merge => {
        "principal.asset.hardware" => "hardware"
      }
      on_error => "no_hardware"
    }
  }

  mutate {
    uppercase => ["DEVICEOS"]
  }

  mutate {
    replace => {
      "principal_platform" => "%{DEVICEOS}"
    }
    on_error => "no_os"
  }

  if [principal_platform] in ["WINDOWS", "MAC", " LINUX", "IOS", "ANDROID", "CHROME_OS"] {
    mutate {
      replace => {
        "principal.platform" => "%{principal_platform}"
      }
      on_error => "no_principal_platform"
    }
  }
  else {
    mutate {
      replace => {
        "principal.platform" => "UNKNOWN_PLATFORM"
      }
    }
  }

  mutate {
    replace => {
      "principal.platform_version" => "%{DEVICEOSVERSION}"
    }
    on_error => "no_DEVICEOSVERSION"
  }

  mutate {
    replace => {
      "network.session_id" => "%{SESSIONID}"
    }
    on_error => "no_SESSIONID"
  }

  mutate {
    replace => {
      "network.http.user_agent" => "%{USERAGENT}"
      "user_agent_field" => "%{USERAGENT}"
    }
    on_error => "no_USERAGENT"
  }

  if ![no_USERAGENT] {
    mutate {
      convert => {
        "user_agent_field" => "parseduseragent"
      }
      on_error => "invalid_conversion"
    }
    if not [invalid_conversion] {
      mutate {
        rename => {
          "user_agent_field" => "network.http.parsed_user_agent"
        }
        on_error => "no_parsed_user_agent"
      }
    }
  }

  mutate {
    replace => {
      "security_result.description" => "%{MESSAGE}"
    }
    on_error => "no_MESSAGE"
  }

  mutate {
    replace => {
      "additional_ADDITIONALDETAILS.value.string_value" => "%{ADDITIONALDETAILS}"
    }
    on_error => "no_ADDITIONALDETAILS"
  }
  if ![no_ADDITIONALDETAILS] {
    mutate {
      replace => {
        "additional_ADDITIONALDETAILS.key" => "ADDITIONALDETAILS"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_ADDITIONALDETAILS"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_AUTHENTICATOR.value.string_value" => "%{AUTHENTICATOR}"
    }
    on_error => "no_AUTHENTICATOR"
  }
  if ![no_AUTHENTICATOR] and [additional_AUTHENTICATOR][value][string_value] != "" {
    mutate {
      replace => {
        "additional_AUTHENTICATOR.key" => "AUTHENTICATOR"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_AUTHENTICATOR"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_DEFAULT_VALUES_LIST.value.string_value" => "%{DEFAULT_VALUES_LIST}"
    }
    on_error => "no_DEFAULT_VALUES_LIST"
  }
  if ![no_DEFAULT_VALUES_LIST] and [additional_DEFAULT_VALUES_LIST][value][string_value] != "" {
    mutate {
      replace => {
        "additional_DEFAULT_VALUES_LIST.key" => "DEFAULT_VALUES_LIST"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_DEFAULT_VALUES_LIST"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_DEVICERELVERSION.value.string_value" => "%{DEVICERELVERSION}"
    }
    on_error => "no_DEVICERELVERSION"
  }
  if ![no_DEVICERELVERSION] and [additional_DEVICERELVERSION][value][string_value] != "" {
    mutate {
      replace => {
        "additional_DEVICERELVERSION.key" => "DEVICERELVERSION"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_DEVICERELVERSION"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_DEVICETYPE.value.string_value" => "%{DEVICETYPE}"
    }
    on_error => "no_DEVICETYPE"
  }
  if ![no_DEVICETYPE] and [additional_DEVICETYPE][value][string_value] != "" {
    mutate {
      replace => {
        "additional_DEVICETYPE.key" => "DEVICETYPE"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_DEVICETYPE"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_ERRORCODE.value.string_value" => "%{ERRORCODE}"
    }
    on_error => "no_ERRORCODE"
  }
  if ![no_ERRORCODE] and [additional_ERRORCODE][value][string_value] != "" {
    mutate {
      replace => {
        "additional_ERRORCODE.key" => "ERRORCODE"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_ERRORCODE"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_ERRORSEVERITY.value.string_value" => "%{ERRORSEVERITY}"
    }
    on_error => "no_ERRORSEVERITY"
  }
  if ![no_ERRORSEVERITY] and [additional_ERRORSEVERITY][value][string_value] != "" {
    mutate {
      replace => {
        "additional_ERRORSEVERITY.key" => "ERRORSEVERITY"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_ERRORSEVERITY"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_EVENTLOGGEDBY.value.string_value" => "%{EVENTLOGGEDBY}"
    }
    on_error => "no_EVENTLOGGEDBY"
  }
  if ![no_EVENTLOGGEDBY] and [additional_EVENTLOGGEDBY][value][string_value] != "" {
    mutate {
      replace => {
        "additional_EVENTLOGGEDBY.key" => "EVENTLOGGEDBY"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_EVENTLOGGEDBY"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_INTEGRATIONPROVIDER.value.string_value" => "%{INTEGRATIONPROVIDER}"
    }
    on_error => "no_INTEGRATIONPROVIDER"
  }
  if ![no_INTEGRATIONPROVIDER] and [additional_INTEGRATIONPROVIDER][value][string_value] != "" {
    mutate {
      replace => {
        "additional_INTEGRATIONPROVIDER.key" => "INTEGRATIONPROVIDER"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_INTEGRATIONPROVIDER"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_INTEGRATIONTYPE.value.string_value" => "%{INTEGRATIONTYPE}"
    }
    on_error => "no_INTEGRATIONTYPE"
  }
  if ![no_INTEGRATIONTYPE] and [additional_INTEGRATIONTYPE][value][string_value] != "" {
    mutate {
      replace => {
        "additional_INTEGRATIONTYPE.key" => "INTEGRATIONTYPE"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_INTEGRATIONTYPE"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_LOGGEDTIMEINUTC.value.string_value" => "%{LOGGEDTIMEINUTC}"
    }
    on_error => "no_LOGGEDTIMEINUTC"
  }
  if ![no_LOGGEDTIMEINUTC] and [additional_LOGGEDTIMEINUTC][value][string_value] != "" {
    mutate {
      replace => {
        "additional_LOGGEDTIMEINUTC.key" => "LOGGEDTIMEINUTC"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_LOGGEDTIMEINUTC"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_MACHINEID.value.string_value" => "%{MACHINEID}"
    }
    on_error => "no_MACHINEID"
  }
  if ![no_MACHINEID] and [additional_MACHINEID][value][string_value] != "" {
    mutate {
      replace => {
        "additional_MACHINEID.key" => "MACHINEID"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_MACHINEID"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_MACHINENAME.value.string_value" => "%{MACHINENAME}"
    }
    on_error => "no_MACHINENAME"
  }
  if ![no_MACHINENAME] and [additional_MACHINENAME][value][string_value] != "" {
    mutate {
      replace => {
        "additional_MACHINENAME.key" => "MACHINENAME"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_MACHINENAME"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_ORIGIN.value.string_value" => "%{ORIGIN}"
    }
    on_error => "no_ORIGIN"
  }
  if ![no_ORIGIN] and [additional_ORIGIN][value][string_value] != "" {
    mutate {
      replace => {
        "additional_ORIGIN.key" => "ORIGIN"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_ORIGIN"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_RPAPPID.value.string_value" => "%{RPAPPID}"
    }
    on_error => "no_RPAPPID"
  }
  if ![no_RPAPPID] and [additional_RPAPPID][value][string_value] != "" {
    mutate {
      replace => {
        "additional_RPAPPID.key" => "RPAPPID"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_RPAPPID"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_SDKRELVERSION.value.string_value" => "%{SDKRELVERSION}"
    }
    on_error => "no_SDKRELVERSION"
  }
  if ![no_SDKRELVERSION] and [additional_SDKRELVERSION][value][string_value] != "" {
    mutate {
      replace => {
        "additional_SDKRELVERSION.key" => "SDKRELVERSION"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_SDKRELVERSION"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_SERVERRELVERSION.value.string_value" => "%{SERVERRELVERSION}"
    }
    on_error => "no_SERVERRELVERSION"
  }
  if ![no_SERVERRELVERSION] and [additional_SERVERRELVERSION][value][string_value] != "" {
    mutate {
      replace => {
        "additional_SERVERRELVERSION.key" => "SERVERRELVERSION"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_SERVERRELVERSION"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_SUBNAME.value.string_value" => "%{SUBNAME}"
    }
    on_error => "no_SUBNAME"
  }
  if ![no_SUBNAME] and [additional_SUBNAME][value][string_value] != "" {
    mutate {
      replace => {
        "additional_SUBNAME.key" => "SUBNAME"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_SUBNAME"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_TENANTID.value.string_value" => "%{TENANTID}"
    }
    on_error => "no_TENANTID"
  }
  if ![no_TENANTID] and [additional_TENANTID][value][string_value] != "" {
    mutate {
      replace => {
        "additional_TENANTID.key" => "TENANTID"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_TENANTID"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_TRACEID.value.string_value" => "%{TRACEID}"
    }
    on_error => "no_TRACEID"
  }
  if ![no_TRACEID] and [additional_TRACEID][value][string_value] != "" {
    mutate {
      replace => {
        "additional_TRACEID.key" => "TRACEID"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_TRACEID"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_TYPE.value.string_value" => "%{TYPE}"
    }
    on_error => "no_TYPE"
  }
  if ![no_TYPE] and [additional_TYPE][value][string_value] != "" {
    mutate {
      replace => {
        "additional_TYPE.key" => "TYPE"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_TYPE"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "additional_USAGETYPE.value.string_value" => "%{USAGETYPE}"
    }
    on_error => "no_USAGETYPE"
  }
  if ![no_USAGETYPE] and [additional_USAGETYPE][value][string_value] != "" {
    mutate {
      replace => {
        "additional_USAGETYPE.key" => "USAGETYPE"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_USAGETYPE"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "sc_action" => "%{ISSUCCESSFUL}"
    }
    on_error => "no_ISSUCCESSFUL"
  }

  if [sc_action] =~ "(?i)true" {
    mutate {
      replace => {
        "sc_action" => "ALLOW"
      }
    }
  }
  else {
    mutate {
      replace => {
        "sc_action" => "BLOCK"
      }
    }
  }

  mutate {
    merge => {
      "security_result.action" => "sc_action"
    }
    on_error => "no_sc_action"
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "merge_error"
    }
  }

  mutate {
    replace => {
      "metadata.product_name" => "HYPR_MFA"
      "metadata.vendor_name" => "HYPR_MFA"
      "metadata.event_type" => "USER_LOGIN"
      "event.idm.read_only_udm.extensions.auth.type" => "SSO"
    }
  }

  mutate {
    rename => {
      "metadata" => "event.idm.read_only_udm.metadata"
      "target" => "event.idm.read_only_udm.target"
      "principal" => "event.idm.read_only_udm.principal"
      "network" => "event.idm.read_only_udm.network"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
