# Product: MCAFEE MVISION CASB
# Category:  CLOUD SECURITY
# Supported Format: KV
# Reference: N/A
# Last Updated: 2023-06-22
# Copyright 2023 Chronicle LLC

filter {
  mutate {
    replace => {
      "activityName" => ""
      "actorIdType" => ""
      "auditEventTypeEventCategoryId" =>""
      "auditEventTypeEventCategoryName" =>""
      "auditEventTypeEventTypeId" => ""
      "auditEventTypeEventTypeName" => ""
      "config_version" => ""
      "contentItemHierarchy" => ""
      "contentItemId" => ""
      "contentItemName" => ""
      "contentItemType" => ""
      "email_details" =>""
      "eventInfo" => ""
      "event_info" => ""
      "externalCollaborators" => ""
      "FileSize" => ""
      "incidentId" => ""
      "incidentRiskSeverityId" => ""
      "informationContentItemParent" => ""
      "informationContentItemCreatedOn" => ""
      "informationEventId" => ""
      "informationFileTypes" => ""
      "informationSource" => ""
      "insertionId"=> ""
      "instanceId" => ""
      "instanceName" => ""
      "objectName" => ""
      "policyId" => ""
      "policyName" => ""
      "recepients" => ""
      "response" => ""
      "riskSeverity" => ""
      "security_result" => ""
      "serviceNames" => ""
      "sourceIps" => ""
      "status" => ""
      "suser" => ""
      "_target" => ""
      "tenantId" => ""
      "totalMatchCount" => ""
      "updatedOn" => ""
      "userInfoFirstName" => ""
      "userInfoLastName" => ""
      "userInfoUserId" => ""
      "user_email" => ""
      "user_login_data" => ""
      "kv_data" => ""
      "host" => ""
      "MessageSourceAddress" => ""
      "actorId" => ""
      "SourceModuleName" => ""
      "SourceModuleType" => ""
      "informationExternalCollaboratorsCount" => ""
    }
  }

  if [message] != "" {
    grok {
      match => {
        "message" => ["<%{INT}>%{SYSLOGTIMESTAMP:time}\\s+%{HOST:host}\\s+(\\w+:\\d+)\\|%{DATA:product}\\|%{DATA:VENDOR}\\|%{GREEDYDATA}\\|%{GREEDYDATA:kv_data}"
                      "<%{INT}>%{SYSLOGTIMESTAMP:timestamp}\\s+%{HOST:host}\\s+...%{DATA}\\s+%{GREEDYDATA:kv_data}"]
      }
      overwrite => ["time", "kv_data", "host"]
      on_error => "not_grok_pattern"
     }
   }

  mutate {
    gsub => ["kv_data", "\\s(\\w+)=", "#$1="]
  }

  if [not_grok_pattern] {
    mutate {
      gsub => ["message", "\"", ""]
    }
    mutate {
      gsub => ["message", "\\,(\\w+)=", "#$1="]
    }

    kv {
      source => "message"
      field_split => "#"
      value_split => "="
    }
  }

  if [kv_data] != "" {
    kv {
        source => "kv_data"
        field_split => "#"
        value_split => "="
    }
  }

  if [suser] != "" {
    mutate {
      replace => {
       "user_email" => "%{suser}"
      }
    }
  }

  if [host] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{host}"
      }
    }
  }

  if [activityName] != "" {
    mutate {
        gsub => ["activityName","\\[|\\]", ""]
      }
    mutate {
      replace => {
        "metadata.product_event_type" => "%{activityName}"
      }
    }
  }

  if [auditEventTypeEventTypeName] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{auditEventTypeEventTypeName}"
      }
    }
  }

  if [incidentId] != "" {
    mutate {
      replace => {
        "metadata.product_log_id" => "%{incidentId}"
      }
    }
  }

  if [auditEventTypeEventTypeId] != "" {
    mutate {
      replace => {
        "metadata.product_log_id" => "%{auditEventTypeEventTypeId}"
      }
    }
  }

  mutate {
    uppercase => ["riskSeverity"]
  }

  if [riskSeverity] != "" && [incidentRiskSeverityId] != "" {
    if [riskSeverity] == "LOW" and [incidentRiskSeverityId] == "0" {
      mutate {
        replace => {
          "security_result.severity" => "LOW"
        }
      }
    }
    else if [riskSeverity] == "MEDIUM" and [incidentRiskSeverityId] == "1" {
      mutate {
        replace => {
          "security_result.severity" => "MEDIUM"
        }
      }
    }
    else if [riskSeverity] == "HIGH" and [incidentRiskSeverityId] == "2" {
      mutate {
        replace => {
          "security_result.severity" => "HIGH"
        }
      }
    }
    else if [riskSeverity] == "INFO" and [incidentRiskSeverityId] == "3" {
      mutate {
        replace => {
          "security_result.severity" => "INFORMATIONAL"
        }
      }
    }
  }

  if [informationContentItemCreatedOn] != "" {
    grok {
      match => {
        "informationContentItemCreatedOn" => [
          "%{TIMESTAMP_ISO8601:collected_timestamp1}"
        ]
      }
      on_error => "date_parsing_error"
    }

    if [date_parsing_error] == true {
      drop {
        tag => "TAG_MALFORMED_MESSAGE"
      }
    }
    else {
      mutate {
        replace => {
          "collected_timestamp" => "%{collected_timestamp1}"
        }
      }
      if [collected_timestamp] != "" {
        date {
          match => ["collected_timestamp","yyyy-MM-dd HH:mm:ss.SSSZ","ISO8601"]
          target => "metadata.collected_timestamp"
        }
      }
    }
  }

  if [contentItemHierarchy] != "" {
    mutate {
      replace => {
        "additional_field.key" => "CONTENT_ITEM_HIERARCHY"
        "additional_field.value.string_value" => "%{contentItemHierarchy}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_field"
      }
    }
  }

  if [contentItemId] != "" {
    mutate {
      replace => {
        "_target.resource.id" => "%{contentItemId}"
      }
    }
  }

  if [contentItemName] != "" {
    mutate {
      replace => {
        "_target.resource.name" => "%{contentItemName}"
      }
    }
  }

  if [informationContentItemParent] != "" {
    mutate {
      replace => {
        "_target.resource.parent" => "%{informationContentItemParent}"
      }
    }
  }

  if [FileSize] not in ["","-1"] {
    mutate {
      replace => {
        "_target.file.size" => "%{FileSize}"
      }
      convert => {
        "_target.file.size" => "uinteger"
      }
    }
  }

  if [contentItemType] != "" {
    mutate {
      replace => {
        "additional_field1.key" => "CONTENT_ITEM_TYPE"
        "additional_field1.value.string_value" => "%{contentItemType}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_field1"
      }
    }
  }

  if [sourceIps] not in  ["","0.0.0.0"] {
    mutate {
      replace => {
        "sourceIps" => "{\"sourceIps\":[\"%{sourceIps}\"]}"
      }
      gsub => ["sourceIps", ", ", "\",\""]
    }
    json {
      source => "sourceIps"
      array_function => "split_columns"
    }
    for ip in sourceIps {
      mutate {
        gsub => ["ip","\\[|\\]", ""]
      }
      if [ip] != "" {
        mutate {
          merge => {
            "principal.ip" => "ip"
          }
        }
      }
    }
  }

  if [MessageSourceAddress] != "" {
    mutate {
      merge => {
        "principal.ip" => "MessageSourceAddress"
      }
    }
  }
  if [informationEventId] != "" {
    mutate {
      replace => {
        "additional_field3.key" => "INFORMATION_EVENT_ID"
        "additional_field3.value.string_value" => "%{informationEventId}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_field3"
      }
    }
  }

  if [user_email] != "" {
    mutate {
      merge => {
       "principal.user.email_addresses" => "user_email"

      }
    }
  }

  if [policyId] != "" {
    mutate {
      replace => {
        "security_result.rule_id" => "%{policyId}"
      }
    }
  }

  if [policyName] != "" {
    mutate {
      replace => {
        "security_result.rule_name" => "%{policyName}"
      }
    }
  }

  if [totalMatchCount] != "" {
    mutate {
      replace => {
        "totalMatchCount_field.key" => "totalMatchCount"
        "totalMatchCount_field.value" => "%{totalMatchCount}"
      }
      merge => {
        "security_result.detection_fields" => "totalMatchCount_field"
      }
    }
  }

  if [instanceId] != "" {
    mutate {
      replace => {
        "principal.resource.product_object_id" => "%{instanceId}"
      }
    }
  }

  if [instanceName] != "" {
    mutate {
      replace => {
        "principal.resource.name" => "%{instanceName}"
      }
    }
  }

  if [response] != "" {
    mutate {
      replace => {
        "action" => "ALLOW"
      }
    }
    mutate {
      merge => {
        "security_result.action" => "action"
      }
    }
  }

  if [serviceNames] != "" {
    mutate {
        gsub => ["serviceNames","\\[|\\]", ""]
    }
    mutate {
      replace => {
        "_target.application" => "%{serviceNames}"
      }
    }
  }

  if [status] != "" {
    mutate {
      replace => {
        "additional_field4.key" => "STATUS"
        "additional_field4.value.string_value" => "%{status}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "additional_field4"
      }
    }
  }

  if [eventInfo] != "" {
    grok {
      match => {
        "message" => ["eventInfo=Config Version:%{DATA:config_version} insertionId"
                      "eventInfo=Report emailed to recepients - %{GREEDYDATA:recepients} insertionId=%{GREEDYDATA}"
                      "eventInfo=(?P<event_info>(User account login failed.%{GREEDYDATA} )|(Page Visited )|User has ?(requested|updated) %{GREEDYDATA})insertionId"]
      }
      overwrite => ["config_version","recepients","event_info"]
    }
    if [event_info] != "" {
      mutate {
        replace => {
          "metadata.description" => "%{event_info}"
        }
      }
    }
    if [config_version] != "" {
      mutate {
        replace => {
          "additional_config.key" => "Config Version"
          "additional_config.value.string_value" => "%{config_version}"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "additional_config"
        }
      }
    }
    if [recepients] != "" {
      mutate {
        replace => {
          "recepients" => "{\"recepients\":[\"%{recepients}\"]}"
        }
        gsub => ["recepients", "," ,"\",\""]
      }

      json {
        source => "recepients"
        array_function => "split_columns"
      }
      for recep in recepients {
        mutate {
          replace => {
            "connect" => "%{recep}"
          }
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.network.email.to" => "connect"
          }
        }
      }
    }
  }

  if [userInfoFirstName] != "" {
    mutate {
      replace => {
        "principal.user.first_name" => "%{userInfoFirstName}"
      }
    }
  }

  if [userInfoLastName] != "" {
    mutate {
      replace => {
        "principal.user.last_name" => "%{userInfoLastName}"
      }
    }
  }

  if [userInfoUserId] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{userInfoUserId}"
      }
    }
  }

  if [actorId] =~ "^.+@.+$" {
    mutate {
      merge => {
        "principal.user.email_addresses" => "actorId"
      }
    }
  }

  if [SourceModuleName] != "" {
    mutate {
      replace => {
        "src_module_name_label.key" => "SOURCE_MODULE_NAME"
        "src_module_name_label.value.string_value" => "%{SourceModuleName}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "src_module_name_label"
      }
    }
  }

  if [SourceModuleType] != "" {
    mutate {
      replace => {
        "principal.resource.resource_subtype" => "%{SourceModuleType}"
      }
    }
  }

  if [actorIdType] != "" {
    mutate {
      replace => {
        "roles.name" => "%{actorIdType}"
      }
      merge => {
        "principal.user.attribute.roles" => "roles"
      }
      on_error => "actor_type_not_found"
    }
  }


  if [auditEventTypeEventCategoryId] != "" {
    mutate {
      replace => {
        "auditEventTypeId_field.key" => "auditEventTypeEventCategoryId"
        "auditEventTypeId_field.value" => "%{auditEventTypeEventCategoryId}"
      }
      merge => {
        "security_result.detection_fields" => "auditEventTypeId_field"
      }
    }
  }

  if [auditEventTypeEventCategoryName] != "" {
    mutate {
      merge => {
        "security_result.category_details" => "auditEventTypeEventCategoryName"
      }
    }
  }
  if [auditEventTypeEventTypeName] != "User login failed" {
    if [objectName] != "" {
      mutate {
        replace => {
          "principal.resource.name" =>"%{objectName}"
        }
      }
    }
  }
  if [tenantId] != "" {
    mutate {
      replace => {
        "tenantId_field.key" => "tenantId"
        "tenantId_field.value" => "%{tenantId}"
      }
      merge => {
        "security_result.detection_fields" => "tenantId_field"
      }
    }
  }

  if [externalCollaborators] != "" {
    mutate {
      replace => {
        "externalCollaborators" =>
        "{\"externalCollaborators\":[\"%{externalCollaborators}\"]}"
      }
      gsub => ["externalCollaborators", ", ", "\",\""]
    }
    json {
      source => "externalCollaborators"
      array_function => "split_columns"
    }
    for collaborators in externalCollaborators {
      mutate {
        gsub => ["collaborators","\\[|\\]", ""]
      }

      grok {
        match => {
          "collaborators" =>
          ["(?P<email_details>[\\w.+=:-]+@[0-9A-Za-z][0-9A-Za-z-]{0,62}(?:[.](?:[0-9A-Za-z][0-9A-Za-z‌-]{0,62}))*)"]
        }
        overwrite => ["email_details"]
        on_error = "email_parsing_error"

      }
      if [collaborators] != "" and ![email_parsing_error] {
        mutate {
          merge => {
            "_target.user.email_addresses" => "collaborators"
          }
        }
      }
    }
  }

  if [informationExternalCollaboratorsCount] != "" {
    mutate {
      replace => {
        "info_coll_cnt_label.key" => "INFORMATION_COLLAB_COUNT"
        "info_coll_cnt_label.value.string_value" => "%{informationExternalCollaboratorsCount}"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "info_coll_cnt_label"
      }
    }
  }

  if [informationFileTypes] != "" {
    mutate {
      replace => {
        "informationFileTypes" =>
        "{\"informationFileTypes\":[\"%{informationFileTypes}\"]}"
      }
      gsub => ["informationFileTypes", ", ", "\",\""]
    }
    json {
      source => "informationFileTypes"
      array_function => "split_columns"
    }
    mutate{
      replace => {
        "file_label.key" => "FileType"
      }
    }
    for fileType in informationFileTypes {
      mutate {
        replace => {
          "value_array" => ""
        }
      }
      mutate {
        gsub => ["fileType","\\[", ""]
      }
      mutate {
        gsub => ["fileType","\\]", ""]
      }
      mutate {
        replace => {
          "value_array.string_value" => "%{fileType}"
        }
        merge => {
          "file_label.value.list_value.values" => "value_array"
        }
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "file_label"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  if [instanceName] != "" or [instanceId] != "" {
    mutate {
      replace => {
        "principal.resource.type" => "VIRTUAL_MACHINE"
      }
    }
  }

  if [tenantId] != "" {
    mutate {
      replace => {
        "principal.resource.type" => "CLOUD_PROJECT"
      }
    }
  }

  if ([suser] != "" or [userInfoUserId] != "")
      and ([contentItemId] != "" or [contentItemName] != "") {
    mutate {
      replace => {
        "metadata.event_type" => "USER_RESOURCE_UPDATE_CONTENT"
      }
    }
  }
  else if [userInfoUserId] != "" and [_target] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else if [user_login_data] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_LOGIN"
      }
    }
  }
  else if [host] != "" or [MessageSourceAddress] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  mutate {
    replace => {
      "metadata.vendor_name" => "McAfee"
      "metadata.product_name" => "MVISION Cloud"
    }
  }
  if [_target] != "" {
    mutate {
      rename => {
      "_target" => "event.idm.read_only_udm.target"
      }
    }
  }
  mutate {
    rename => {
      "metadata" => "event.idm.read_only_udm.metadata"
      "principal" => "event.idm.read_only_udm.principal"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
