# Product: IBM Customer Information Control System (CICS)
# Category: Service Bus
# Supported Format: LEEF
# Reference: See below
# Last Updated: 2021-10-27
# Copyright 2021 Chronicle LLC


# Additional references
# https://www.ibm.com/products/cics-transaction-server
# https://www.ibm.com/support/knowledgecenter/en/SS42VS_DSM/com.ibm.dsm.doc/c_DSM_guide_IBM_CICS_intro.html
# https://www.ibm.com/support/knowledgecenter/SS42VS_DSM/com.ibm.dsm.doc/b_dsm_guide.pdf?origURL=SS42VS_DSM/b_dsm_guide.pdf

filter {
  grok {
    match => {
      "message" => [
        "%{WORD}:%{BASE10NUM}\\|%{WORD}\\|%{WORD}\\|%{BASE10NUM:version}\\|%{DATA:event_type}\\|%{GREEDYDATA:values}"
      ]
    }
    on_error => "parsing_error"
  }

  if [parsing_error] == true {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }

  mutate {
    replace => {
      "kv.src" => ""
      "kv.terminal" => ""
      "kv.usrName" => ""
    }
  }

  mutate {
      gsub => ["values", "[·|\\t]", "#"]
  }

  kv {
    source => "values"
    field_split => "#"
    value_split => "="
    unescape_field_split => true
    target => "kv"
  }

  if [kv][terminal] == "" and [kv][usrName] == "" {
    # drop if (terminal) is not present since we are unable to map the principal.hostname
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }

  date {
    match => ["kv.devTime", "yyyy-MM-ddTHH:mm:ss.SSSZ"]
  }

  grok {
    match => {
      "kv.name" => ["%{GREEDYDATA:lastname}, %{GREEDYDATA:firstname}"]
    }
    on_error => "has_not_lastname"
  }

  if ![has_not_lastname] {
    mutate {
      rename => {
        "firstname" => "event.idm.read_only_udm.principal.user.first_name"
        "lastname" => "event.idm.read_only_udm.principal.user.last_name"
      }
    }
  }

  if [kv][terminal] != "" {
    mutate {
      replace => {
         "event.idm.read_only_udm.principal.hostname" => "%{kv.terminal}"
      }
    }
  }

  mutate {
    rename => {
      # principal
      "kv.usrName" => "event.idm.read_only_udm.principal.user.userid"
      "kv.name" => "event.idm.read_only_udm.principal.user.user_display_name"

      # target
      "kv.appl" => "event.idm.read_only_udm.target.application"

      # metadata
      "kv.sum" => "event.idm.read_only_udm.metadata.description"
      "event_type" => "event.idm.read_only_udm.metadata.product_event_type"
      "version" => "event.idm.read_only_udm.metadata.product_version"
    }
    replace => {
      "event.idm.read_only_udm.target.process.product_specific_process_id" => "tran:%{kv.tran}"
      "event.idm.read_only_udm.metadata.vendor_name" => "IBM"
      "event.idm.read_only_udm.metadata.product_name" => "CICS"
    }
  }

  if [kv][src] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "kv.src"
      }
    }
  }

  if [kv][src] != "" or [kv][terminal] != "" {
    mutate {
      replace => {
          "event.idm.read_only_udm.metadata.event_type" => "PROCESS_UNCATEGORIZED"
      }
    }
  }
  else {
    mutate {
      replace => {
          "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }


  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
