# Product: DELL_CYBERSENSE
# Category: Data Security
# Supported Format: SYSLOG
# Reference: N/A
# Last Updated: 2025-02-13
# Copyright 2025 Google SecOps

filter {
  mutate {
    replace => {
      "ts" => ""
      "severity" => ""
      "kv_data" => ""
      "client_IP" => ""
      "session" => ""
      "cradmin" => ""
      "tty" => ""
      "version" => ""
      "device_vendor" => ""
      "device_product" => ""
      "device_version" => ""
      "device_event_class_id" => ""
      "crjobids" => ""
      "crpolicy" => ""
      "lanjobdefname" => ""
      "lanjobinstid" => ""
      "event_name" => ""
      "kv_msg" => ""
      "msg" => ""
      "hostname" => ""
      "event_type" => ""
      "principal_mid_present" => "false"
      "metadata" => ""
      "principal" => ""
      "target" => ""
      "network" => ""
      "additional" => ""
      "security_result" => ""
      "dbname" => ""
      "dbuuid" => ""
      "json_msg" => ""
    }
  }
  mutate {
    gsub => ["message", "message", "msg"]
  }
  grok {
    match => {
       "message" => [
          "<%{INT}>%{DATA} %{DATA}: %{WORD:severity}: %{DATA}: \\(%{GREEDYDATA:kv_data}\\) %{DATA}: %{GREEDYDATA:cradmin}"
          "<%{INT}>%{SYSLOGTIMESTAMP:ts} %{DATA:hostname} %{DATA}: CEF:%{INT:version}\\|%{DATA:device_vendor}\\|%{DATA:device_product}\\|%{DATA:device_version}\\|%{DATA:device_event_class_id}\\|%{DATA:event_name} \\- %{DATA}\\|%{DATA}\\|{%{GREEDYDATA:kv_msg}"
        ]
    }
    overwrite => ["kv_data", "severity" , "cradmin", "ts", "kv_msg", "version", "device_vendor", "device_product", "device_version", "device_event_class_id", "event_name", "hostname"]
    on_error  => "header_grok_match_failed"
  }

  if [header_grok_match_failed] {
    mutate {
      gsub => ["message", "\\r\\n", ""]
    }
    grok {
      match => {
        "message" => [
            "<%{INT}>%{SYSLOGTIMESTAMP:ts} %{HOSTNAME:hostname} %{DATA}: %{DATA}:%{INT:version}\\|%{DATA:device_vendor}\\|%{DATA:device_product}\\|%{DATA:device_version}\\|%{DATA:device_event_class_id}\\|%{DATA:event_name}\\|%{DATA}\\|%{GREEDYDATA:json_msg}"
          ]
      }
      overwrite => [ "ts", "version", "device_vendor", "device_product", "device_version", "device_event_class_id", "event_name", "hostname", "json_msg" ]
      on_error  => "json_grok_match_failed"
    }
    if [json_msg] != "" {
      mutate {
        replace => {
          "crjobid" => ""
          "engine_id" => ""
          "URL" => ""
          "host" => ""
          "path" => ""
          "infection_classes" => ""
        }
      }
      json {
        source => "json_msg"
        array_function => "split_columns"
        on_error => "json_msg_invalid"
      }
      if [crjobid] != "" {
        mutate {
          convert => {
            "crjobid" => "string"
          }
          on_error => "crjobid_invalid"
        }
        mutate {
          replace => {
            "crjobids_label.key" => "crjobid"
            "crjobids_label.value" => "%{crjobid}"
          }
          on_error => "crjobid_empty"
        }
        if ![crjobid_empty] {
          mutate {
            merge => {
              "security_result.detection_fields" => "crjobids_label"
            }
            on_error => "crjobid_empty"
          }
        }
      }
      if [engine_id] != "" {
        mutate {
          replace => {
            "engine_id_label.key" => "engine_id"
            "engine_id_label.value" => "%{engine_id}"
          }
          on_error => "engine_id_empty"
        }
        if ![engine_id_empty] {
          mutate {
            merge => {
              "security_result.detection_fields" => "engine_id_label"
            }
            on_error => "engine_id_empty"
          }
        }
      }
      if [URL] != "" {
        mutate {
          replace => {
            "principal.url" => "%{URL}"
          }
          on_error => "URL_empty"
        }
      }
      if [host] != "" {
        mutate {
          replace => {
            "target.hostname" => "%{host}"
            "target.asset.hostname" => "%{host}"
          }
          on_error => "host_empty"
        }
      }
      if [path] != "" {
        mutate {
          replace => {
            "principal.file.full_path" => "%{path}"
          }
          on_error => "path_empty"
        }
      }
      mutate {
        replace => {
          "infected_list.value" => ""
        }
      }
      for infected in infection_classes {
        mutate {
          replace => {
            "infected_label" => ""
          }
        }
        mutate {
          replace => {
            "infected_label.string_value" => "%{infected}"
          }
          on_error => "infected_label_empty"
        }
        if ![infected_label_empty] {
          mutate {
            merge => {
              "infected_list.value.list_value.values" => "infected_label"
            }
            on_error => "infected_list_empty"
          }
        }
      }
      if [infected_list][value] != "" {
        mutate {
          replace => {
            "infected_list.key" => "infection_classes"
          }
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "infected_list"
          }
          on_error => "infected_list_empty"
        }
      }
    }
    if [json_grok_match_failed] {
      drop {
        tag => "TAG_MALFORMED_MESSAGE"
      }
    }
  }

  if [ts] != "" {
    date {
      match => ["ts", "ISO8601", "MMM  d HH:mm:ss"]
      rebase => true
      on_error => "date_match_failed"
    }
  }

  if [kv_data] != "" {
    kv {
      source => "kv_data"
      field_split => ","
      value_split => "="
      on_error => "kv_data_invalid"
    }
  }
  if [kv_msg] != "" {
    mutate {
      gsub => ["kv_msg", "\'", ""]
    }
    mutate {
      gsub => ["kv_msg", '\"', ""]
    }
    kv {
      source => "kv_msg"
      field_split => ","
      value_split => ":"
      on_error => "kv_msg_invalid"
    }
  }
  if [dbname] != "" {
    mutate {
      replace => {
        "target.resource.name" => "%{dbname}"
      }
      on_error => "dbname_empty"
    }
  }
  if [dbuuid] != "" {
    mutate {
      gsub => ["dbuuid", "}", ""]
    }
    mutate {
      replace => {
        "target.resource.product_object_id" => "%{dbuuid}"
      }
      on_error => "dbuuid_empty"
    }
  }
  if [severity] in ["EMERGENCY","ALERT","CRITICAL"] {
    mutate {
      replace => {
        "security_result.severity" => "CRITICAL"
      }
    }
  }
  else if [severity] == "ERROR" {
    mutate {
      replace => {
        "security_result.severity" => "ERROR"
      }
    }
  }
  else if [severity] == "WARN" {
    mutate {
      replace => {
        "security_result.severity" => "HIGH"
      }
    }
  }
  else if [severity] == "NOTICE" {
    mutate {
      replace => {
        "security_result.severity" => "MEDIUM"
      }
    }
  }
  else if [severity] == "INFO" {
    mutate {
      replace => {
        "security_result.severity" => "INFORMATIONAL"
      }
    }
  }
  if [device_vendor] != "" {
    mutate {
      replace => {
        "metadata.vendor_name" => "%{device_vendor}"
      }
      on_error => "device_vendor_empty"
    }
  }
  if [device_product] != "" {
    mutate {
      replace => {
        "metadata.product_name" => "%{device_product}"
      }
      on_error => "device_product_empty"
    }
  }
  if [device_version] != "" {
    mutate {
      replace => {
        "metadata.product_version" => "%{device_version}"
      }
      on_error => "device_version_empty"
    }
  }
  if [event_name] != "" and [device_event_class_id] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "[%{device_event_class_id}] - %{event_name}"
      }
    }
  } else if [device_event_class_id] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{device_event_class_id}"
      }
    }
  } else if [event_name] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{event_name}"
      }
      on_error => "event_name_empty"
    }
  }
  if [hostname] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{hostname}"
        "principal.asset.hostname" => "%{hostname}"
        "principal_mid_present" => "true"
      }
      on_error => "hostname_empty"
    }
  }
  if [client_IP] != "" {
    grok {
      match => {
        "client_IP" => [
          "%{IP:client_IP}"
        ]
      }
      overwrite => ["client_IP"]
      on_error => "client_IP_invalid"
    }
    if ![client_IP_invalid] {
      mutate {
        merge => {
          "principal.ip" => "%{client_IP}"
          "principal.asset.ip" => "%{client_IP}"
        }
        on_error => "client_IP_invalid"
      }
    }
    else {
      mutate {
        replace => {
          "principal.hostname" => "%{client_IP}"
          "principal.asset.hostname" => "%{client_IP}"
        }
        on_error => "client_IP_invalid"
      }
    }
    mutate {
      replace => {
        "principal_mid_present" => "true"
      }
    }
  }
  if [session] != "" {
    mutate {
      replace => {
        "network.session_id" => "%{session}"
      }
      on_error => "transaction_id_not_found"
    }
  }
  if [crjobids] != "" {
    mutate {
      replace => {
        "crjobids_label.key" => "crjobids"
        "crjobids_label.value.string_value" => "%{crjobids}"
      }
      on_error => "crjobids_label_empty"
    }
    if ![crjobids_label_empty] {
      mutate {
        merge => {
          "additional.fields" => "crjobids_label"
        }
      }
    }
  }
  if [crpolicy] != "" {
    mutate {
      replace => {
        "crpolicy_label.key" => "crpolicy"
        "crpolicy_label.value.string_value" => "%{crpolicy}"
      }
      on_error => "crpolicy_label_empty"
    }
    if ![crpolicy_label_empty] {
      mutate {
        merge => {
          "additional.fields" => "crpolicy_label"
        }
        on_error => "crpolicylabel_empty"
      }
    }
  }
  if [lanjobdefname] != "" {
    mutate {
      replace => {
        "lanjobdefname_label.key" => "lanjobdefname"
        "lanjobdefname_label.value.string_value" => "%{lanjobdefname}"
      }
      on_error => "lanjobdefname_label_empty"
    }
    if ![lanjobdefname_label_empty] {
      mutate {
        merge => {
          "additional.fields" => "lanjobdefname_label"
        }
        on_error => "lanjobdefnamelabel_empty"
      }
    }
  }
  if [lanjobinstid] != "" {
    mutate {
      replace => {
        "lanjobinstid_label.key" => "lanjobinstid"
        "lanjobinstid_label.value.string_value" => "%{lanjobinstid}"
      }
      on_error => "lanjobinstid_label_empty"
    }
    if ![lanjobinstid_label_empty] {
      mutate {
        merge => {
          "additional.fields" => "lanjobinstid_label"
        }
        on_error => "lanjobinstidlabel_empty"
      }
    }
  }
  if [msg] != "" {
    mutate {
      gsub => ["msg", " }", ""]
    }
    mutate {
      replace => {
        "metadata.description" => "%{msg}"
      }
      on_error => "msg_empty"
    }
  }
  if [cradmin] != "" {
    mutate {
      replace => {
        "principal.process.command_line" => "%{cradmin}"
      }
      on_error => "cmd_data_empty"
    }
  }
  if [tty] != "" {
    mutate {
      replace => {
        "tty_label.key" => "tty"
        "tty_label.value.string_value" => "%{tty}"
      }
      on_error => "tty_label_empty"
    }
    if ![tty_label_empty] {
      mutate {
        merge => {
          "additional.fields" => "tty_label"
        }
      }
    }
  }
  if [device_vendor] == "" {
    mutate {
      replace => {
        "metadata.vendor_name" => "DELL_CYBERSENSE"
      }
      on_error => "device_vendor_empty"
    }
  }
  if [device_product] == "" {
    mutate {
      replace => {
        "metadata.product_name" => "DELL_CYBERSENSE"
      }
      on_error => "device_product_empty"
    }
  }

  if [event_type] == "" {
    if [principal_mid_present] == "true" {
      mutate {
        replace => {
          "event_type" => "STATUS_UPDATE"
        }
      }
    }
    else {
      mutate {
        replace => {
          "event_type" => "GENERIC_EVENT"
        }
      }
    }
  }

  if [event_type] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "%{event_type}"
      }
      on_error => "event_type_value_invalid"
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }
  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "security_result_empty"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
