# Product: Mandiant Digital Threat Monitoring
# Category: Data Security
# Supported Format: JSON
# Reference: N/A
# Last Updated: 2026-06-23
# Copyright 2026 Google SecOps

filter {
  mutate {
    replace => {
      "id" => ""
      "created_at" => ""
      "title" => ""
      "alert_type" => ""
      "doc_matches_value" => ""
      "labels_label" => ""
      "topics_value" => ""
      "alert_summary" => ""
      "app_protocol_src" => ""
      "security_result" => ""
      "app_protocol_output" => ""
      "doc_source_file_size" => ""
      "doc_email" => ""
      "email_domain" => ""
      "data_filename" => ""
      "data_md5" => ""
      "data_sha1" => ""
      "doc_service_name" => ""
      "data_sha256" => ""
      "doc_url" => ""
      "doc_source_url" => ""
      "doc_service_account_login" => ""
      "doc_protocol" => ""
      "doc_service_account_service_inet_location_path" => ""
      "doc_service_account_service_inet_location_url" => ""
      "doc_service_account_service_inet_location_domain" => ""
      "doc_service_account_service_name" => ""
      "has_principal_user" => "false"
    }
  }
  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_json"
  }
  date {
    match => ["doc.timestamp", "ISO8601"]
    on_error => "timestamp_parse_error"
  }
  date {
    match => ["doc.ingested", "ISO8601"]
    target => "event.idm.read_only_udm.metadata.collected_timestamp"
    on_error => "ingested_parse_error"
  }
  if [title] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{title}"
      }
      on_error => "not_description"
    }
  }
  if [id] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_log_id" => "%{id}"
      }
      on_error => "not_product_log_id"
    }
  }
  if [alert_type] != "" {
    mutate {
      merge => {
        "security_result.category_details" => "alert_type"
      }
      on_error => "not_alert_type"
    }
  }
  mutate {
    replace => {
      "doc_protocol" => "%{doc.service_account.service.inet_location.protocol}"
    }
    on_error => "not_doc_protocol"
  }
  if [doc_protocol] != "" {
    mutate {
      replace => {
        "app_protocol_src" => "%{doc_protocol}"
      }
      on_error => "invalid_network_application_protocol_result"
    }
    if ![invalid_network_application_protocol_result] {
      # This file contains application protocol parsing logic

# Interface:
# app_protocol_src (required): string that contains application protocol or a
#                              port number
# app_protocol_output: string that is either empty or contains application
#                      protocol compatible to ApplicationProtocol enum in
#                      udm.proto

mutate {
  uppercase => [ "app_protocol_src" ]
}

if [app_protocol_src] in [ "22", "SSH", "SSHD" ] {
  mutate {
    replace => {
      "app_protocol_output" => "SSH"
    }
  }
}
else if [app_protocol_src] in [ "25", "SMTP" ] {
  mutate {
    replace => {
      "app_protocol_output" => "SMTP"
    }
  }
}
else if [app_protocol_src] in [ "53", "DNS" ] {
  mutate {
    replace => {
      "app_protocol_output" => "DNS"
    }
  }
}
else if [app_protocol_src] in [ "80", "8080", "HTTP" ] {
  mutate {
    replace => {
      "app_protocol_output" => "HTTP"
    }
  }
}
else if [app_protocol_src] in [ "443", "HTTPS", "TLS" ] {
  mutate {
    replace => {
      "app_protocol_output" => "HTTPS"
    }
  }
}
else if [app_protocol_src] in [ "7400", "7401", "7402", "DDS" ] {
  mutate {
    replace => {
      "app_protocol_output" => "DDS"
    }
  }
}
else if [app_protocol_src] in [ "SMB", "SMBV1" ] {
  mutate {
    replace => {
      "app_protocol_output" => "SMB"
    }
  }
}
else if [app_protocol_src] in [
  "UNKNOWN_APPLICATION_PROTOCOL", "AFP", "APPC", "AMQP", "ATOM", "BEEP",
  "BITCOIN", "BIT_TORRENT", "CFDP", "COAP", "DEVICE_NET", "DHCP", "E_DONKEY",
  "ENRP", "FAST_TRACK", "FINGER", "FREENET", "FTAM", "GOPHER", "HL7", "H323",
  "IRCP", "KADEMLIA", "LDAP", "LPD", "MIME", "MODBUS", "MQTT", "NETCONF",
  "NFS", "NIS", "NNTP", "NTCIP", "NTP", "OSCAR", "PNRP", "QUIC", "RDP", "RELP",
  "RIP", "RLOGIN", "RPC", "RTMP", "RTP", "RTPS", "RTSP", "SAP", "SDP", "SIP",
  "SLP", "SNTP", "SSMS", "STYX", "TCAP", "TDS", "TOR", "TSP", "VTP", "WHOIS",
  "WEB_DAV", "X400", "X500", "XMPP", "IEC104", "DCERPC"
] {
  mutate {
    replace => {
      "app_protocol_output" => "%{app_protocol_src}"
    }
  }

} else {
  mutate {
    replace => {
      "app_protocol_output" => ""
    }
  }
}

      if [app_protocol_output] != "" {
        mutate {
          replace => {
            "event.idm.read_only_udm.network.application_protocol" => "%{app_protocol_output}"
          }
          on_error => "invalid_app_protocol_output"
        }
      }
    }
  }
  mutate {
    convert => {
      "doc.source_file.size" => "string"
    }
    on_error => "no_doc_source_file_size_convert"
  }
  mutate {
    replace => {
      "doc_source_file_size" => "%{doc.source_file.size}"
    }
    on_error => "not_doc_source_file_size_replace"
  }
  if [doc_source_file_size] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.file.size" => "%{doc_source_file_size}"
      }
      on_error => "not_doc_source_file_size_mapped"
    }
    mutate {
      convert => {
        "event.idm.read_only_udm.principal.file.size" => "uinteger"
      }
      on_error => "not_doc_source_file_size_integer"
    }
  }
  mutate {
    replace => {
      "doc_email" => "%{doc.service_account.profile.contact.email}"
    }
    on_error => "not_doc_email"
  }
  if [doc_email] != "" and [doc_email] =~ "^.+@.+$" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.user.email_addresses" => "doc_email"
      }
      on_error => "not_doc_email_merge"
    }
  }
  mutate {
    replace => {
      "email_domain" => "%{doc.service_account.profile.contact.email_domain}"
    }
    on_error => "not_email_domain"
  }
  if [email_domain] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.administrative_domain" => "%{email_domain}"
      }
      on_error => "not_email_domain_merge"
    }
  }
  mutate {
    replace => {
      "data_filename" => "%{doc.source_file.filename}"
    }
    on_error => "not_data_filename"
  }
  if [data_filename] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.file.names" => "data_filename"
      }
      on_error => "not_data_filename_merge"
    }
  }
  mutate {
    replace => {
      "data_md5" => "%{doc.source_file.hashes.md5}"
    }
    on_error => "not_data_md5"
  }
  if [data_md5] != "" and [data_md5] =~ "^[0-9a-f]+$" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.file.md5" => "%{data_md5}"
      }
      on_error => "not_data_md5_merge"
    }
  }
  mutate {
    replace => {
      "data_sha1" => "%{doc.source_file.hashes.sha1}"
    }
    on_error => "not_data_sha1"
  }
  if [data_sha1] != "" and [data_sha1] =~ "^[0-9a-f]+$" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.file.sha1" => "%{data_sha1}"
      }
      on_error => "not_data_sha1_replace"
    }
  }
  mutate {
    replace => {
      "data_sha256" => "%{doc.source_file.hashes.sha256}"
    }
    on_error => "not_data_sha256"
  }
  if [data_sha256] != "" and [data_sha256] =~ "^[0-9a-f]+$" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.file.sha256" => "%{data_sha256}"
      }
      on_error => "not_data_sha256_replace"
    }
  }
  mutate {
    replace => {
      "doc_source_url" => "%{doc.source_url}"
    }
    on_error => "not_doc_url"
  }
  if [doc_source_url] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.url" => "%{doc_source_url}"
      }
      on_error => "not_doc_url_replace"
    }
  }
  mutate {
    replace => {
      "doc_service_account_login" => "%{doc.service_account.login}"
    }
    on_error => "not_doc_service_account_login"
  }
  if [doc_service_account_login] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{doc_service_account_login}"
        "has_principal_user" => "true"
      }
      on_error => "not_doc_service_account_login_merge"
    }
  }
  mutate {
    replace => {
      "doc_service_account_service_inet_location_url" => "%{doc.service_account.service.inet_location.url}"
    }
    on_error => "not_doc_service_account_service_inet_location_url"
  }
  if [doc_service_account_service_inet_location_url] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.url" => "%{doc_service_account_service_inet_location_url}"
      }
      on_error => "not_doc_service_account_service_inet_location_url_merge"
    }
  }
  mutate {
    replace => {
      "doc_service_account_service_inet_location_domain" => "%{doc.service_account.service.inet_location.domain}"
    }
    on_error => "not_doc_service_account_service_inet_location_domain"
  }
  if [doc_service_account_service_inet_location_domain] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{doc_service_account_service_inet_location_domain}"
        "event.idm.read_only_udm.principal.asset.hostname" => "%{doc_service_account_service_inet_location_domain}"
      }
      on_error => "not_doc_service_account_service_inet_location_domain_merge"
    }
  }
  mutate {
    replace => {
      "doc_service_account_service_inet_location_path" => "%{doc.service_account.service.inet_location.path}"
    }
    on_error => "not_doc_service_account_service_inet_location_path"
  }
  if [doc_service_account_service_inet_location_path] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.file.full_path" => "%{doc_service_account_service_inet_location_path}"
      }
      on_error => "not_doc_service_account_service_inet_location_path_merge"
    }
  }
  mutate {
    replace => {
      "doc_service_account_service_name" => "%{doc.service_account.service.name}"
    }
    on_error => "not_doc_service_account_service_name"
  }
  if [doc_service_account_service_name] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.application" => "%{doc_service_account_service_name}"
      }
      on_error => "not_doc_service_account_service_name_merge"
    }
  }
  mutate {
    replace => {
      "doc_service_name" => "%{doc.service.name}"
    }
    on_error => "not_doc_service_name"
  }
  if [doc_service_name] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.application" => "%{doc_service_name}"
      }
      on_error => "not_doc_service_name_merge"
    }
  }
  for index, match in doc_matches {
    mutate {
      convert => {
        "index" => "string"
      }
      on_error => "not_doc_matches_index_string"
    }
    mutate {
      replace => {
        "match_path_label" => ""
        "match_path" => ""
      }
    }
    mutate {
      replace => {
        "match_path" => "%{match.match_path}"
      }
      on_error => "not_match_path"
    }
    if [match_path] != "" {
      mutate {
        replace => {
          "match_path_label.value" => "%{match_path}"
          "match_path_label.key" => "match_%{index}"
        }
        on_error => "not_match_path_label"
      }
      if ![not_match_path_label] {
        mutate {
          merge => {
            "event.idm.read_only_udm.principal.asset.attribute.labels" => "match_path_label"
          }
          on_error => "not_match_path_label_merge"
        }
      }
    }
    for index2, location in match.locations {
      mutate {
        convert => {
          "location" => "string"
        }
        on_error => "not_location_string"
      }
      mutate {
        convert => {
          "index2" => "string"
        }
        on_error => "not_index2_string"
      }
      mutate {
        replace => {
          "location_value_label" => ""
          "offsets_label" => ""
          "location_offsets_label" => ""
          "location_value" => ""
          "offset_arr" => ""
          "has_location_offsets" => "false"
        }
      }
      for offset in location.offsets {
        mutate {
          convert => {
            "offset" => "string"
          }
          on_error => "offset_conversion_error_"
        }
        mutate {
          replace => {
            "offset_arr" => ""
          }
        }
        mutate {
          replace => {
            "offset_arr.string_value" => "%{offset}"
          }
          on_error => "offset_empty"
        }
        mutate {
          merge => {
            "location_offsets_label.value.list_value.values" => "offset_arr"
          }
          on_error => "offset_not_found"
        }
        if ![offset_not_found] {
          mutate {
            replace => {
              "has_location_offsets" => "true"
            }
          }
        }
      }
      if [has_location_offsets] == "true" {
        mutate {
          replace => {
            "location_offsets_label.key" => "location_offsets_%{index}_%{index2}"
          }
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "location_offsets_label"
          }
          on_error => "location_offsets_label_merge_error"
        }
      }
      mutate {
        replace => {
          "location_value" => "%{location.value}"
        }
        on_error => "not_location_value"
      }
      if [location_value] != "" {
        mutate {
          replace => {
            "location_value_label.value.string_value" => "%{location.value}"
            "location_value_label.key" => "location_%{index}_%{index2}"
          }
          on_error => "not_location_value_label"
        }
        if ![not_location_value_label] {
          mutate {
            merge => {
              "event.idm.read_only_udm.additional.fields" => "location_value_label"
            }
            on_error => "not_location_value_label_merge"
          }
        }
      }
    }
  }
  for index, topic in topics {
    mutate {
      convert => {
        "index" => "string"
      }
      on_error => "not_index_string"
    }
    mutate {
      replace => {
        "topics_label" => ""
        "topics_value" => ""
        "topic_type" => ""
        "url_label" => ""
        "extractor_label" => ""
        "domain_label" => ""
        "extractor_value" => ""
        "id_label" => ""
        "id_value" => ""
      }
    }
    mutate {
      replace => {
        "extractor_value" => "%{topic.extractor}"
      }
      on_error => "not_extractor_value"
    }
    if [extractor_value] != "" {
      mutate {
        replace => {
          "extractor_label.value.string_value" => "%{extractor_value}"
          "extractor_label.key" => "extractor_%{index}"
        }
        on_error => "not_extractor_label"
      }
      if ![not_extractor_label] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "extractor_label"
          }
          on_error => "not_extractor_label_merge"
        }
      }
    }
    mutate {
      replace => {
        "id_value" => "%{topic.id}"
      }
      on_error => "not_id_value"
    }
    if [id_value] != "" {
      mutate {
        replace => {
          "id_label.value.string_value" => "%{id_value}"
          "id_label.key" => "topics_id_%{index}"
        }
        on_error => "not_id_label"
      }
      if ![not_id_label] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "id_label"
          }
          on_error => "not_id_label_merge"
        }
      }
    }
    mutate {
      replace => {
        "topic_type" => "%{topic.type}"
      }
      on_error => "not_topic_type"
    }
    mutate {
      replace => {
        "topics_value" => "%{topic.value}"
      }
      on_error => "not_topics_value"
    }
    if [topics_value] != "" {
      mutate {
        replace => {
          "topics_label.value.string_value" => "%{topics_value}"
          "topics_label.key" => "%{topic_type}_%{index}"
        }
        on_error => "not_topics_label"
      }
      if ![not_topics_label] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "topics_label"
          }
          on_error => "not_topics_label_merge"
        }
      }
    }
    for index2, element in topic.entity_locations {
      mutate {
        convert => {
          "element" => "string"
        }
        on_error => "not_element_string"
      }
      mutate {
        convert => {
          "index2" => "string"
        }
        on_error => "not_entity_locations_index2_string"
      }
      mutate {
        replace => {
          "element_path_label" => ""
          "element_path_value" => ""
        }
      }
      mutate {
        replace => {
          "element_path_value" => "%{element.element_path}"
        }
        on_error => "not_element_path_value"
      }
      if [element_path_value] != "" {
        mutate {
          replace => {
            "element_path_label.value.string_value" => "%{element_path_value}"
            "element_path_label.key" => "element_path_%{index}_%{index2}"
          }
          on_error => "not_element_path_label"
        }
        if ![not_element_path_label] {
          mutate {
            merge => {
              "event.idm.read_only_udm.additional.fields" => "element_path_label"
            }
            on_error => "not_element_path_label_merge"
          }
        }
      }
      for index3, offset in element.offsets {
        mutate {
          convert => {
            "offset" => "string"
          }
          on_error => "not_offset_string"
        }
        mutate {
          convert => {
            "index3" => "string"
          }
          on_error => "not_index3_string"
        }
        mutate {
          replace => {
            "offset_label" => ""
            "offset_value" => ""
          }
        }
        mutate {
          replace => {
            "offset_value" => "%{offset}"
          }
          on_error => "not_offset_value"
        }
        if [offset_value] != "" {
          mutate {
            replace => {
              "offset_label.value.string_value" => "%{offset_value}"
              "offset_label.key" => "offset_%{index}_%{index2}_%{index3}"
            }
            on_error => "not_offset_label"
          }
          if ![not_offset_label] {
            mutate {
              merge => {
                "event.idm.read_only_udm.additional.fields" => "offset_label"
              }
              on_error => "not_offset_label_merge"
            }
          }
        }
      }
    }
  }
  for index, item in topic_matches {
    mutate {
      convert => {
        "index" => "string"
      }
      on_error => "not_topic_index_string"
    }
    mutate {
      replace => {
        "item_value_label" => ""
        "topic_id_value_label" => ""
        "topic_id_value" => ""
        "item_value" => ""
      }
    }
    mutate {
      replace => {
        "item_value" => "%{item.value}"
      }
      on_error => "not_key_value"
    }
    if [item_value] != "" {
      mutate {
        replace => {
          "item_value_label.value.string_value" => "%{item_value}"
          "item_value_label.key" => "topic_matches_value_%{index}"
        }
        on_error => "not_item_value_label"
      }
      if ![not_item_value_label] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "item_value_label"
          }
          on_error => "not_item_value_label_merge"
        }
      }
    }
    mutate {
      replace => {
        "topic_id_value" => "%{item.topic_id}"
      }
      on_error => "not_topic_id_value"
    }
    if [topic_id_value] != "" {
      mutate {
        replace => {
          "topic_id_value_label.value.string_value" => "%{topic_id_value}"
          "topic_id_value_label.key" => "topic_matches_id_%{index}"
        }
        on_error => "not_topic_id_value_label"
      }
      if ![not_topic_id_value_label] {
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "topic_id_value_label"
          }
          on_error => "not_topic_id_value_label_merge"
        }
      }
    }
  }
  if [alert_summary] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{alert_summary}"
      }
      on_error => "not_alert_summary"
    }
  }
  if [doc_url] != "" {
    mutate {
      replace => {
        "security_result.url_back_to_product" => "%{doc_url}"
      }
      on_error => "no_doc_url_error"
    }
  }
  for index, item in labels {
    mutate {
      convert => {
        "index" => "string"
      }
      on_error => "not_labels_index_string"
    }
    for key, label in item map {
      mutate {
        convert => {
          "label" => "string"
        }
        on_error => "not_label_string"
      }
      mutate {
        replace => {
          "label_value" => ""
          "labels_value_label" => ""
        }
      }
      mutate {
        replace => {
          "label_value" => "%{label}"
        }
        on_error => "not_confidence_value"
      }
      if [key] == "confidence" and [label_value] != "" {
        mutate {
          replace => {
            "security_result.confidence_score" => "%{label_value}"
          }
          on_error => "security_result_confidence_score_failed"
        }
        mutate {
          convert => {
            "security_result.confidence_score" => "float"
          }
          on_error => "convert_security_result_confidence_score_failed"
        }
      }
      else if [label_value] != "" {
        mutate {
          replace => {
            "labels_value_label.value.string_value" => "%{label_value}"
            "labels_value_label.key" => "%{key}_%{index}"
          }
          on_error => "not_labels_label"
        }
        if ![not_labels_label] {
          mutate {
            merge => {
              "event.idm.read_only_udm.additional.fields" => "labels_value_label"
            }
            on_error => "not_labels_label_merge"
          }
        }
      }
      for key, detail in label map {
        mutate {
          replace => {
            "detail_label" => ""
            "check_value" => ""
          }
        }
        mutate {
          convert => {
            "detail" => "string"
          }
          on_error => "not_detail_string_conversion"
        }
        mutate {
          replace => {
            "check_value" => "%{detail}"
          }
          on_error => "not_detail_string"
        }
        if [check_value] != "" {
          mutate {
            replace => {
              "detail_label.value.string_value" => "%{detail}"
              "detail_label.key" => "label_%{key}_%{index}"
            }
            on_error => "not_detail_label"
          }
          if ![not_detail_label] {
            mutate {
              merge => {
                "event.idm.read_only_udm.additional.fields" => "detail_label"
              }
              on_error => "not_detail_label_merge"
            }
          }
        }
      }
    }
  }
  mutate {
    rename => {
      "status" => "addition.status"
      "monitor_id" => "addition.monitor_id"
      "updated_at" => "addition.updated_at"
      "monitor_version" => "addition.monitor_version"
      "meets_password_policy" => "addition.meets_password_policy"
      "indicator_mscore" => "addition.indicator_mscore"
      "aggregated_under_id" => "addition.aggregated_under_id"
      "doc.__id" => "addition.doc_id"
      "doc.ingested" => "addition.doc_ingested"
      "doc.service_account.password.plain_text" => "addition.doc_service_account_password_plain_text"
      "doc.__type" => "addition.doc_type"
      "doc.source" => "addition.doc_source"
      "created_at" => "addition.created_at"
      "labels_url" => "addition.labels_url"
      "topics_url" => "addition.topics_url"
      "has_analysis" => "addition.has_analysis"
    }
  }
  for key, value in addition map {
    mutate {
      replace => {
        "field1" => ""
        "check" => ""
      }
    }
    mutate {
      convert => {
        "value" => "string"
      }
      on_error => "no_value_conversion"
    }
    mutate {
      replace => {
        "check" => "%{value}"
      }
      on_error => "no_value"
    }
    if ![no_value] and [check] not in ["","N/A"] {
      mutate {
        replace => {
          "field1.key" => "%{key}"
        }
        on_error => "no_field1_key"
      }
      if [key] in ["status","monitor_id","meets_password_policy","indicator_mscore"] {
        mutate {
          replace => {
            "field1.value" => "%{value}"
          }
          on_error => "no_field1_security_detection_value"
        }
        mutate {
          merge => {
            "security_result.detection_fields" => "field1"
          }
          on_error => "no_field1_security_detection_merge"
        }
      }
      else {
        mutate {
          replace => {
            "field1.value.string_value" => "%{value}"
          }
          on_error => "no_field1_value"
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "field1"
          }
          on_error => "no_field1_merge"
        }
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "security_result_not_merged"
    }
  }
  if [has_principal_user] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "MANDIANT_DTM_ALERTS"
      "event.idm.read_only_udm.metadata.product_name" => "MANDIANT"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
