# Product: BLUECAT_EDGE
# Category: DNS
# Supported Format:JSON, KV, SYSLOG
# Reference : https://docs.bluecatnetworks.com/r/DNS-Edge-User-Guide/Filters
# Last Updated: 2022-01-18
# Copyright 2022 Chronicle LLC

filter {
  mutate {
    replace => {
      "Content-Type" => ""
      "Content-Length" => ""
      "customerId" => ""
      "parentDomain" => ""
      "product_event_type" => ""
      "sourceAddress" => ""
      "sourcePort" => ""
      "question.domainName" => ""
      "security_result" => ""
      "threats" => ""
      "User-Agent" => ""
      "requestData.time" => ""
      "responseData.time" => ""
      "time" => ""
      "event_type" => ""
    }
  }

  json {
   source => "message"
   array_function => "split_columns"
   on_error => "not_in_json"
  }

  if ![not_in_json] {
    if [time] != "" {
      mutate {
        convert => {
          "time" => "string"
        }
        gsub => [ "time", "\\d{3}$", "" ]
      }
      date {
        match => ["time", "UNIX"]
      }
    }
    if [requestData][time] != "" {
      mutate {
        convert => {
          "requestData.time" => "string"
        }
        gsub => [ "requestData.time", "\\d{3}$", "" ]
        }
      date {
        match => ["requestData.time", "UNIX"]
      }
    }
    if [responseData][time] != "" {
      mutate {
        convert => {
          "responseData.time" => "string"
        }
        gsub => [ "responseData.time", "\\d{3}$", "" ]
      }
      date {
        match => ["responseData.time", "UNIX"]
      }
    }

    if [socketProtocol] in ['TCP', 'UDP'] {
      mutate {
        replace => {
          "network.ip_protocol" => "%{socketProtocol}"
        }
      }
    }

    if [customerId] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.user.userid" => "%{customerId}"
        }
      }
    }

    if [sourceAddress] != "" {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "sourceAddress"
        }
      }
    }

    if [sourcePort] != "" {
      mutate {
        convert => {
          "sourcePort" => "integer"
        }
      }
      mutate {
        rename => {
          "sourcePort" => "event.idm.read_only_udm.principal.port"
        }
      }
    }

    if [parentDomain] != "" {
      mutate {
        gsub => ["parentDomain","\.$",""]
      }
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.administrative_domain" => "%{parentDomain}"
        }
      }
    }

    mutate {
      rename => {
        "responseData.header.id" => "network.dns.id"
        "responseData.header.aa" => "network.dns.authoritative"
        "responseData.header.tc" => "network.dns.truncated"
        "responseData.header.rd" => "network.dns.recursion_desired"
        "responseData.header.ra" => "network.dns.recursion_available"
        "responseData.header.opcode" => "network.dns.opcode"
        "responseData.header.rcode" => "network.dns.response_code"
      }
      convert => {
        "network.dns.id" => "uinteger"
        "network.dns.opcode" => "uinteger"
        "network.dns.response_code" => "uinteger"
      }
    }

    for question in requestData.question {
      mutate {
        replace => {
          "dns_question" => ""
        }
      }
      mutate {
        rename => {
          "question.questionTypeId" => "dns_question.type"
        }
        convert => {
          "dns_question.type" => "uinteger"
        }
      }
      mutate {
        gsub => ["question.domainName","\.$",""]
      }
      if [question][domainName] != "" {
        mutate {
          replace => {
            "dns_question.name" => "%{question.domainName}"
            "event_type" => "NETWORK_DNS"
          }
        }
      }
      mutate {
        merge => {
          "network.dns.questions" => "dns_question"
        }
      }
    }
    if [event_type] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "%{event_type}"
          "network.application_protocol" => "DNS"
        }
      }
    }
    else {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
        }
      }
    }
    for answer in responseData.answers {
      mutate {
        replace => {
          "dns_answer" => ""
        }
      }
      mutate {
        rename => {
          "answer.recordTypeId" => "dns_answer.type"
        }
        convert => {
          "dns_answer.type" => "uinteger"
        }
      }
      mutate {
        gsub => ["answer.domainName","\.$",""]
      }
      mutate {
        replace => {
          "dns_answer.name" => "%{answer.domainName}"
        }
      }
      mutate {
        rename => {
          "answer.ttl" => "dns_answer.ttl"
        }
        convert => {
          "dns_answer.ttl" => "uinteger"
        }
      }
      mutate {
        merge => {
          "network.dns.answers" => "dns_answer"
        }
      }
    }

    for domain in responseData.authority {
      mutate {
        gsub => ["domain.domainName","\.$",""]
        replace => {
          "authority" => ""
        }
      }
      mutate {
        rename => {
          "domain.domainName" => "authority.data"
        }
      }
      mutate {
        merge => {
          "network.dns.authority" => "authority"
        }
      }
    }

    for domain in responseData.additional {
      mutate {
        gsub => ["domain.domainName","\.$",""]
        replace => {
          "additional" => ""
        }
      }
      mutate {
        rename => {
          "domain.domainName" => "additional.data"
        }
      }
      mutate {
        merge => {
          "network.dns.additional" => "additional"
        }
      }
    }

    if [threats] != "" {
      for threat in threats {
        mutate {
          replace => {
            "security_result.threat_name" => "%{threat.type}"
          }
        }
        for indicator in threat.indicators {
          mutate {
            merge => {
              "security_result.category_details" => "indicator"
            }
          }
        }
      }
    }

    if [siteId] != "" {
      mutate {
        replace => {
          "additional_siteId.key" => "siteId"
          "additional_siteId.value.string_value" => "%{siteId}"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "additional_siteId"
        }
      }
    }
    if [servicePointId] != "" {
      mutate {
        replace => {
          "additional_serviceId.key" => "servicePointId"
          "additional_serviceId.value.string_value" => "%{servicePointId}"
        }
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "additional_serviceId"
        }
      }
    }
    if [product_event_type] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.product_event_type" => "%{eventType}"
        }
      }
    }
  }
  else {
    grok {
      match => {
        "message" => ["%{DATA:method} / %{GREEDYDATA:http_version}","Host: %{HOST:hostname}:%{INT:port}"]
      }
      on_error => "grok_fail"
    }
    if ![grok_fail] {
      if [message] =~ "Host" {
        mutate {
          rename => {
            "hostname" => "event.idm.read_only_udm.principal.hostname"
            "port" => "event.idm.read_only_udm.principal.port"
          }
          convert => {
            "event.idm.read_only_udm.principal.port" => "integer"
          }
        }
      }
      else {
        mutate {
          replace => {
            "network.http.method" => "%{method}"
            "network.application_protocol" => "HTTP"
          }
        }
      }
    }
    else {
      kv {
        source => "message"
        field_split => ""
        value_split => ": "
      }
      if [User-Agent] != "" {
        mutate {
          replace => {
            "network.http.user_agent" => "%{User-Agent}"
          }
        }
      }
      if [Content-Type] != "" {
        mutate {
          replace => {
            "additional_ContentType.key" => "Content-Type"
            "additional_ContentType.value.string_value" => "%{Content-Type}"
          }
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "additional_ContentType"
          }
        }
      }

      if [Content-Length] != "" {
        mutate {
          replace => {
            "additional_ContentLength.key" => "Content-Length"
            "additional_ContentLength.value.string_value" => "%{Content-Length}"
          }
        }
        mutate {
          merge => {
            "event.idm.read_only_udm.additional.fields" => "additional_ContentLength"
          }
        }
      }
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  mutate {
    rename => {
      "network" => "event.idm.read_only_udm.network"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
