# Product: SAP_SAST
# Category: Security
# Supported Format: SYSLOG
# Reference: NA
# Last Updated: 2023-12-28
# Copyright 2023 Chronicle LLC

filter {
  mutate {
    replace => {
      "security_result" => ""
      "event_type" => ""
      "metadata" => ""
      "principal" => ""
      "additional" => ""
      "has_principal" => "false"
      "has_target" => "false"
      "target" => ""
      "date_time" => ""
      "vendor" => ""
      "product" => ""
      "product_event_type" => ""
      "product_version" => ""
      "kv_data" => ""
      "SAP_TERMINAL" => ""
      "principal_ip" => ""
      "target_ip" => ""
      "target_host" => ""
      "principal_host" => ""
      "SourceWorkstation" => ""
      "src" => ""
      "SAP_INSTANCE" => ""
      "SAP_HOSTNAME" => ""
      "proto" => ""
      "network" => ""
      "usrName" => ""
      "extensions" => ""
      "isLoginEvent" => ""
      "SAP_SYSTEM" => ""
      "SAP_REPORT" => ""
      "SAP_CLIENT" => ""
      "sev" => ""
      "SAP_LOG_ID" => ""
      "SAP_DATASOURCE" => ""
      "SAP_MSG" => ""
      "cat" => ""
    }
  }
  grok {
    match => {
      "message" => ["<%{INT}>%{DATA:date_time}\\s+%{DATA}\\s+LEEF:%{DATA}\\|%{DATA:vendor}\\|%{DATA:product}\\|%{DATA:product_version}\\|%{DATA:product_event_type}\\s*\\|%{GREEDYDATA:kv_data}"]
    }
    on_error => "grok_fail"
    overwrite => ["date_time","vendor","product","product_event_type","product_version","kv_data"]
  }

  if [grok_fail] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }
  if [date_time] != "" {
    date {
      match => ["date_time", "SYSLOGTIMESTAMP","ISO8601"]
      target => "metadata.event_timestamp"
      on_error => "no_match_for_timestamp"
    }
  }
  if [vendor] != "" {
    mutate {
      replace => {
        "metadata.vendor_name" => "%{vendor}"
      }
      on_error => "vendor_error"
    }
  }
  if [product] != "" {
    mutate {
      replace => {
        "metadata.product_name" => "%{product}"
      }
      on_error => "product_error"
    }
  }
  if [product_version] != "" {
    mutate {
      replace => {
        "metadata.product_version" => "%{product_version}"
      }
      on_error => "no_product_version"
    }
  }
  if [product_event_type] != "" {
    mutate {
      replace => {
        "metadata.product_event_type" => "%{product_event_type}"
      }
      on_error => "no_product_event"
    }
  }
  if [kv_data] != "" {
    mutate {
      gsub => ["kv_data","Source Workstation","SourceWorkstation"]
    }
    mutate {
      gsub => ["kv_data","\\t","#"]
    }
    kv {
      source => "kv_data"
      field_split => "#"
      value_split => "="
      on_error => "not_kv"
    }
  }
  if [SAP_TERMINAL] != "" {
    grok {
      match => {
        "SAP_TERMINAL" => ["%{IP:ip}"]
      }
      overwrite => ["ip"]
      on_error => "not_an_ip"
    }
    if ![not_an_ip] {
      mutate {
        replace => {
          "target_ip" => "%{ip}"
        }
        on_error => "ip_error"
      }
    }
    else {
      mutate {
        replace => {
          "target_host" => "%{SAP_TERMINAL}"
        }
        on_error => "target_host_error"
      }
    }
  }
  if [SourceWorkstation] != "" {
    grok {
      match => {
        "SourceWorkstation" => ["%{IP:ip}"]
      }
      overwrite => ["ip"]
      on_error => "not_a_ip"
    }
    if ![not_a_ip] and [target_ip] == "" {
      mutate {
        replace => {
          "target_ip" => "%{ip}"
        }
        on_error => "target_ip_error"
      }
    }
    else if [target_host] == "" {
      mutate {
        replace => {
          "target_host" => "%{SourceWorkstation}"
        }
        on_error => "host_error"
      }
    }
  }
  if [src] != "" {
    grok {
      match => {
        "src" => ["%{IP:src}"]
      }
      overwrite => ["src"]
      on_error => "invalid_ip"
    }
    if ![invalid_ip] {
      mutate {
        merge => {
          "principal.ip" => "src"
        }
        on_error => "src_error"
      }
    }
  }
  if [SAP_INSTANCE] != "" {
    mutate {
      replace => {
        "principal_host" => "%{SAP_INSTANCE}"
      }
      on_error => "sap_instance_error"
    }
  }
  if [SAP_HOSTNAME] != "" and [principal_host] == "" {
    mutate {
      replace => {
        "principal_host" => "%{SAP_HOSTNAME}"
      }
      on_error => "sap_host_error"
    }
  }
  if [proto] != "" {
    if [proto]  =~ "(?i)tcp" {
      mutate {
        replace => {
          "network.ip_protocol" => "TCP"
        }
      }
    }
    else if [proto]  =~ "(?i)udp" {
      mutate {
        replace => {
          "network.ip_protocol" => "UDP"
        }
      }
    }
  }
  if [SAP_SYSTEM] != "" {
    mutate {
      replace => {
        "sap_system.key" => "SAP_SYSTEM"
        "sap_system.value.string_value" => "%{SAP_SYSTEM}"
      }
      on_error => "sap_system_error"
    }
    if ![sap_system_error] {
      mutate {
        merge => {
          "additional.fields" => "sap_system"
        }
        on_error => "sap_system_merge_error"
      }
    }
  }
  if [SAP_DATASOURCE] != "" {
    mutate {
      replace => {
        "sap_datasource.key" => "SAP_DATASOURCE"
        "sap_datasource.value.string_value" => "%{SAP_DATASOURCE}"
      }
      on_error => "sap_datasource_error"
    }
    if ![sap_datasource_error] {
      mutate {
        merge => {
          "additional.fields" => "sap_datasource"
        }
        on_error => "sap_datasource_merge_error"
      }
    }
  }

  if [sev] != "" {
    mutate {
      replace => {
        "severity.key" => "Severity"
        "severity.value" => "%{sev}"
      }
      on_error => "severity_error"
    }
    if ![severity_error] {
      mutate {
        merge => {
          "security_result.detection_fields" => "severity"
        }
        on_error => "severity_merge_error"
      }
    }
  }
  if [cat] != "" {
      if [cat] == "Info" {
        mutate {
          replace => {
            "security_result.severity" => "INFORMATIONAL"
          }
        }
      }
      else if [cat] == "Error" {
        mutate {
          replace => {
            "security_result.severity" => "ERROR"
          }
        }
      }
      else if [cat] == "Warning" {
        mutate {
          replace => {
            "security_result.severity" => "MEDIUM"
          }
        }
      }
      else {
        mutate {
          replace => {
            "security_result.severity" => "UNKNOWN_SEVERITY"
          }
        }
      }
    }

  if [SAP_REPORT] != "" {
    mutate {
      replace => {
        "sap_report.key" => "SAP_REPORT"
        "sap_report.value.string_value" => "%{SAP_REPORT}"
      }
      on_error => "sap_report_error"
    }
    if ![sap_report_error] {
      mutate {
        merge => {
          "additional.fields" => "sap_report"
        }
        on_error => "sap_report_merge_error"
      }
    }
  }
  if [SAP_CLIENT] != "" {
    mutate {
      replace => {
        "sap_client.key" => "SAP_CLIENT"
        "sap_client.value.string_value" => "%{SAP_CLIENT}"
      }
      on_error => "sap_client_error"
    }
    if ![sap_client_error] {
      mutate {
        merge => {
          "additional.fields" => "sap_client"
        }
        on_error => "sap_client_merge_error"
      }
    }
  }
  if [SAP_MSG] != "" {
    mutate {
      replace => {
        "metadata.description" => "%{SAP_MSG}"
      }
      on_error => "sap_msg_not_found"
    }
  }
  if [usrName] != "" {
    mutate {
      replace => {
        "principal.user.user_display_name" => "%{usrName}"
      }
      on_error => "username_not_found"
    }
  }
  if [SAP_LOG_ID] != "" {
    mutate {
      replace => {
        "metadata.product_log_id" => "%{SAP_LOG_ID}"
      }
      on_error => "log_id_error"
    }
  }


  if [principal_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "principal_ip"
      }
      on_error => "not_valid_ip"
    }
    if ![not_valid_ip] {
      mutate {
        replace => {
          "has_principal" => "true"
        }
      }
    }
  }
  if [principal_host] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{principal_host}"
        "has_principal" => "true"
      }
      on_error => "prin_host_error"
    }
  }
  if [target_ip] != "" {
    mutate {
      merge => {
        "target.ip" => "target_ip"
      }
      on_error => "merge_error"
    }
    if ![merge_error] {
      mutate {
        replace => {
          "has_target" => "true"
        }
      }
    }
  }
  if [target_host] != "" {
    mutate {
      replace => {
        "target.hostname" => "%{target_host}"
        "has_target" => "true"
      }
      on_error => "tar_host_error"
    }
  }
  if [has_principal] == "true" and [has_target] == "true" and [isLoginEvent] == "true" {
    mutate {
      replace => {
        "event_type" => "USER_LOGIN"
        "extensions.auth.type" => "AUTHTYPE_UNSPECIFIED"
      }
    }
  }
  else if [has_principal] == "true" and [has_target] == "true" and [network] != "" {
    mutate {
      replace => {
        "event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "event_type" => "STATUS_UPDATE"
      }
    }
  }
  if [event_type] != "" {
    mutate {
      replace => {
        "metadata.event_type" => "%{event_type}"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }
  if [extensions] != "" {
    mutate {
      rename => {
        "extensions" => "event.idm.read_only_udm.extensions"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "sec_result_error"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
