# Product: PerimeterX_Bot_Protection
# Category: Security
# Supported Format: JSON
# Reference: N/A
# Last Updated: 2024-03-27
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "browser_family" => ""
      "browser_version" => ""
      "client_ip" => ""
      "city" => ""
      "country" => ""
      "domain" => ""
      "event_type" => ""
      "full_url" => ""
      "os_family" => ""
      "os_version" => ""
      "px_app_id" => ""
      "px_client_uuid" => ""
      "px_vid" => ""
      "true_ip_asn_name" => ""
      "referrer" => ""
      "user_agent" => ""
      "risk_score" => ""
      "path" => ""
      "timestamp" => ""
      "principal" => ""
      "target" => ""
      "network" => ""
      "metadata" => ""
      "additional" => ""
      "custom_parameter1" => ""
      "custom_parameter2" => ""
      "custom_parameter3" => ""
      "custom_parameter4" => ""
      "custom_parameter5" => ""
      "custom_parameter6" => ""
      "custom_parameter7" => ""
      "custom_parameter8" => ""
      "custom_parameter9" => ""
      "security_result" => ""
      "has_principal" => "false"
      "has_target" => "false"
    }
  }

  mutate {
    gsub => ["message",'custom_parameter(.?)\\":null',"custom_parameter$1\":\"null\""]
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_json"
  }

  if [not_json] {
    drop{
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }
  mutate {
    replace => {
      "metadata.vendor_name" => "NGINX"
      "metadata.product_name" => "PERIMETERX_BOT_PROTECTION"
    }
  }
  if [timestamp] != "" {
    date {
      match => ["timestamp", "RFC3339"]
      on_error => "no_time"
    }
  }

  if [px_app_id] != "" {
    mutate {
      replace => {
        "app_id.value" => "%{px_app_id}"
      }
      on_error => "px_app_id_empty"
    }
    if ![px_app_id_empty] {
      mutate {
        replace => {
          "app_id.key" => "px_app_id"
        }
      }
      mutate {
        merge => {
          "principal.resource.attribute.labels" => "app_id"
        }
      }
    }
  }

  if [px_client_uuid] != "" {
    mutate {
      replace => {
        "principal.asset.asset_id" => "clientUuid: %{px_client_uuid}"
      }
      on_error => "px_client_uuid_empty"
    }
  }

  if [px_vid] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{px_vid}"
      }
      on_error => "px_vid_empty"
    }
  }

  if [client_ip] != "" {
    mutate {
      merge => {
        "principal.ip" => "client_ip"
        "principal.asset.ip" => "client_ip"
      }
      on_error => "client_ip_empty"
    }
    mutate {
      replace => {
        "has_principal" => "true"
      }
    }
  }

  if [domain] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{domain}"
        "principal.asset.hostname" => "%{domain}"
        "has_principal" => "true"
      }
      on_error => "domain_empty"
    }
  }

  if [country] != "" {
    mutate {
      replace => {
        "principal.location.country_or_region" => "%{country}"
      }
      on_error => "country_empty"
    }
  }

  if [city] != "" {
    mutate {
      replace => {
        "principal.location.city" => "%{city}"
      }
      on_error => "city_empty"
    }
  }

  if [os_family] == "Win" {
    mutate {
      replace => {
        "principal.platform" => "WINDOWS"
      }
    }
  }
  else if [os_family] in ["Mac","iOS"] {
    mutate {
      replace => {
        "principal.platform" => "MAC"
      }
    }
  }
  else if [os_family] == "Lin" {
    mutate {
      replace => {
        "principal.platform" => "LINUX"
      }
    }
  }

  if [os_version] != "" {
    mutate {
      replace => {
        "principal.platform_version" => "%{os_version}"
      }
      on_error => "os_version_empty"
    }
  }

  if [full_url] != "" {
    mutate {
      replace => {
        "target.url" => "%{full_url}"
      }
      on_error => "full_url_empty"
    }
  }

  if [path] != "" {
    mutate {
      replace => {
        "target.file.full_path" => "%{path}"
      }
      on_error => "path_empty"
    }
  }

  if [user_agent] != "" {
    mutate {
      replace => {
        "network.http.user_agent" => "%{user_agent}"
      }
      on_error => "user_agent_empty"
    }
    mutate {
      convert => {
        "user_agent" => "parseduseragent"
      }
      on_error => "convert_failed"
    }
    if ![convert_failed] {
      mutate {
        rename => {
          "user_agent" => "network.http.parsed_user_agent"
        }
      }
    }
  }

  if [referrer] not in ["","-"] {
    mutate {
      replace => {
        "network.http.referral_url" => "%{referrer}"
      }
      on_error => "referrer_empty"
    }
  }

  if [true_ip_asn_name] != "" {
    mutate {
      replace => {
        "true_ip_asn_name_label.value.string_value" => "%{true_ip_asn_name}"
      }
      on_error => "true_ip_asn_name_empty"
    }
    if ![true_ip_asn_name_empty] {
      mutate {
        replace => {
          "true_ip_asn_name_label.key" => "true_ip_asn_name"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "true_ip_asn_name_label"
        }
      }
    }
  }

  if [event_type] != "" {
    mutate {
      replace => {
        "event_type_label.value.string_value" => "%{event_type}"
      }
      on_error => "event_type_empty"
    }
    if ![event_type_empty] {
      mutate {
        replace => {
          "event_type_label.key" => "event_type"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "event_type_label"
        }
      }
    }
  }

  if [custom_parameter1] != "" {
    mutate {
      convert => {
        "custom_parameter1" => "string"
      }
      on_error => "already_string"
    }
    mutate {
      replace => {
        "custom_parameter1_label.value.string_value" => "%{custom_parameter1}"
      }
      on_error => "custom_parameter1_empty"
    }
    if ![custom_parameter1_empty] {
      mutate {
        replace => {
          "custom_parameter1_label.key" => "custom_parameter1"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "custom_parameter1_label"
        }
        on_error => "custom_parameter1_label_empty"
      }
    }
  }

  if [custom_parameter3] != "" {
    mutate {
      convert => {
        "custom_parameter3" => "string"
      }
      on_error => "already_string"
    }
    mutate {
      replace => {
        "custom_parameter3_label.value.string_value" => "%{custom_parameter3}"
      }
      on_error => "custom_parameter3_empty"
    }
    if ![custom_parameter3_empty] {
      mutate {
        replace => {
          "custom_parameter3_label.key" => "custom_parameter3"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "custom_parameter3_label"
        }
        on_error => "custom_parameter3_label_empty"
      }
    }
  }

  if [custom_parameter2] != "" {
    mutate {
      convert => {
        "custom_parameter2" => "string"
      }
      on_error => "already_string"
    }
    mutate {
      replace => {
        "custom_parameter2_label.value.string_value" => "%{custom_parameter2}"
      }
      on_error => "custom_parameter2_empty"
    }
    if ![custom_parameter2_empty] {
      mutate {
        replace => {
          "custom_parameter2_label.key" => "custom_parameter2"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "custom_parameter2_label"
        }
        on_error => "custom_parameter2_label_empty"
      }
    }
  }

  if [custom_parameter4] != "" {
    mutate {
      convert => {
        "custom_parameter4" => "string"
      }
      on_error => "already_string"
    }
    mutate {
      replace => {
        "custom_parameter4_label.value.string_value" => "%{custom_parameter4}"
      }
      on_error => "custom_parameter4_empty"
    }
    if ![custom_parameter4_empty] {
      mutate {
        replace => {
          "custom_parameter4_label.key" => "custom_parameter4"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "custom_parameter4_label"
        }
        on_error => "custom_parameter4_label_empty"
      }
    }
  }

  if [custom_parameter5] != "" {
    mutate {
      convert => {
        "custom_parameter5" => "string"
      }
      on_error => "already_string"
    }
    mutate {
      replace => {
        "custom_parameter5_label.value.string_value" => "%{custom_parameter5}"
      }
      on_error => "custom_parameter5_empty"
    }
    if ![custom_parameter5_empty] {
      mutate {
        replace => {
          "custom_parameter5_label.key" => "custom_parameter5"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "custom_parameter5_label"
        }
        on_error => "custom_parameter5_label_empty"
      }
    }
  }

  if [custom_parameter6] != "" {
    mutate {
      convert => {
        "custom_parameter6" => "string"
      }
      on_error => "already_string"
    }
    mutate {
      replace => {
        "custom_parameter6_label.value.string_value" => "%{custom_parameter6}"
      }
      on_error => "custom_parameter6_empty"
    }
    if ![custom_parameter6_empty] {
      mutate {
        replace => {
          "custom_parameter6_label.key" => "custom_parameter6"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "custom_parameter6_label"
        }
        on_error => "custom_parameter6_label_empty"
      }
    }
  }

  if [custom_parameter7] != "" {
    mutate {
      convert => {
        "custom_parameter7" => "string"
      }
      on_error => "already_string"
    }
    mutate {
      replace => {
        "custom_parameter7_label.value.string_value" => "%{custom_parameter7}"
      }
      on_error => "custom_parameter7_empty"
    }
    if ![custom_parameter7_empty] {
      mutate {
        replace => {
          "custom_parameter7_label.key" => "custom_parameter7"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "custom_parameter7_label"
        }
        on_error => "custom_parameter7_label_empty"
      }
    }
  }

  if [custom_parameter8] != "" {
    mutate {
      convert => {
        "custom_parameter8" => "string"
      }
      on_error => "already_string"
    }
    mutate {
      replace => {
        "custom_parameter8_label.value.string_value" => "%{custom_parameter8}"
      }
      on_error => "custom_parameter8_empty"
    }
    if ![custom_parameter8_empty] {
      mutate {
        replace => {
          "custom_parameter8_label.key" => "custom_parameter8"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "custom_parameter8_label"
        }
        on_error => "custom_parameter6_label_empty"
      }
    }
  }

  if [custom_parameter9] != "" {
    mutate {
      convert => {
        "custom_parameter9" => "string"
      }
      on_error => "already_string"
    }
    mutate {
      replace => {
        "custom_parameter9_label.value.string_value" => "%{custom_parameter9}"
      }
      on_error => "custom_parameter9_empty"
    }
    if ![custom_parameter9_empty] {
      mutate {
        replace => {
          "custom_parameter9_label.key" => "custom_parameter9"
        }
      }
      mutate {
        merge => {
          "additional.fields" => "custom_parameter9_label"
        }
        on_error => "custom_parameter9_label_empty"
      }
    }
  }

  mutate {
    convert => {
      "risk_score" => "string"
    }
    on_error => "risk_score_already_string"
  }

  if [risk_score] != "" {
    mutate {
      replace => {
          "security_result.risk_score" => "%{risk_score}"
      }
      on_error => "risk_score_empty"
    }
    mutate {
      convert => {
        "security_result.risk_score" => "float"
      }
      on_error => "risk_score_conversion_failed"
    }
  }

  if [browser_family] != "" {
    mutate {
      replace => {
        "detection_browser_family.value" => "%{browser_family}"
      }
      on_error => "browser_family_empty"
    }
    if ![browser_family_empty] {
      mutate {
        replace => {
          "detection_browser_family.key" => "browser_family"
        }
      }
      mutate {
        merge => {
          "security_result.detection_fields" => "detection_browser_family"
        }
        on_error => "detection_browser_family_fail"
      }
    }
  }

  if [browser_version] != "" {
    mutate {
      replace => {
        "detection_browser_version.value" => "%{browser_version}"
      }
      on_error => "browser_version_empty"
    }
    if ![browser_version_empty] {
      mutate {
        replace => {
          "detection_browser_version.key" => "browser_version"
        }
      }
      mutate {
        merge => {
          "security_result.detection_fields" => "detection_browser_version"
        }
        on_error => "detection_browser_version_fail"
      }
    }
  }

  if [has_principal] == "true" and [has_target] == "false" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }
  if [network] != "" {
    mutate {
      rename => {
        "network" => "event.idm.read_only_udm.network"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  if [additional] != "" {
    mutate {
      rename => {
        "additional" => "event.idm.read_only_udm.additional"
      }
    }
  }

  # Generate output
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
