# Product: IBM B2B INTEGRATOR
# Category: FILE_TRANSFER
# Supported Format: XML
# Reference: N/A
# Last Updated: 2026-07-02
# Copyright 2026 Google SecOps


filter {
  mutate {
    replace => {
      "has_principal" => "false"
      "has_target" => "false"
      "has_http" => "false"
      "has_user" => "false"
      "target_data_present" => "false"
      "credential_type" => ""
      "is_authenticated" => ""
      "is_counterparty" => ""
      "endpoint1" => ""
      "endpoint2" => ""
      "authenticate_id" => ""
      "credential_value" => ""
      "adapter_name" => ""
      "principal_id" => ""
      "event_time" => ""
      "protocol" => ""
      "session_id" => ""
      "security_result" => ""
      "principal" => ""
      "event1" => ""
      "event" => ""
      "security_result_action" => ""
      "report_group_by" => ""
      "detail_group_by_value" => ""
    }
  }
  mutate {
    gsub => ["message", "\\r\\n\\s+", ""]
  }
  mutate {
    gsub => [
      "message", "<\\?xml.*?\\?>\\s*", ""
    ]
  }

  xml {
    source => "message"
    xpath => {
      "/Report/@groupBy" => "report_group_by"
      "/Report/Detail/@groupByValue" => "detail_group_by_value"
    }
  }

  for index, detailRow in xml(message, /Report/Detail/DetailRow) {
    mutate {
      replace => {
        "row_admin_audit_id" => ""
        "row_principal" => ""
        "row_action_value" => ""
        "row_event_time" => ""
        "row_object_type" => ""
        "row_object_name" => ""
        "row_action_type" => ""
        "report_group_by_label" => ""
        "detail_group_by_value_label" => ""
        "lbl_admin_audit_id_label" => ""
        "lbl_row_principal_label" => ""
        "lbl_action_value_label" => ""
        "lbl_event_time_label" => ""
        "lbl_object_type_label" => ""
        "lbl_object_name_label" => ""
        "lbl_action_type_label" => ""
        "event1" =>  ""
        "security_result" => ""
      }
    }

    xml {
      source => "message"
      xpath => {
        "/Report/Detail/DetailRow[%{index}]/ADMIN_AUDIT_ID" => "row_admin_audit_id"
        "/Report/Detail/DetailRow[%{index}]/PRINCIPAL" => "row_principal"
        "/Report/Detail/DetailRow[%{index}]/ACTION_VALUE" => "row_action_value"
        "/Report/Detail/DetailRow[%{index}]/TIME" => "row_event_time"
        "/Report/Detail/DetailRow[%{index}]/OBJECT_TYPE" => "row_object_type"
        "/Report/Detail/DetailRow[%{index}]/OBJECT_NAME" => "row_object_name"
        "/Report/Detail/DetailRow[%{index}]/ACTION_TYPE" => "row_action_type"
      }
      on_error => "row_xml_error"
    }
    if [row_xml_error] {
      drop {
        tag => "TAG_MALFORMED_MESSAGE"
      }
    }
    if [row_event_time] != "" {
      date {
        match => ["row_event_time", "yyyy-MM-dd HH:mm:ss.S"]
        target => "event1.idm.read_only_udm.metadata.event_timestamp"
        on_error => "main_event_time_match_failed"
      }
    }
    if [row_admin_audit_id] != "" {
      mutate {
        replace => {
          "event1.idm.read_only_udm.metadata.product_log_id" => "%{row_admin_audit_id}"
        }
        on_error => "lbl_admin_audit_id_label_replace_failed"
      }
    }
    if [row_principal] != "" {
      mutate {
        replace => {
          "event1.idm.read_only_udm.principal.user.userid" => "%{row_principal}"
          "has_user" => "true"
        }
        on_error => "lbl_row_principal_label_replace_failed"
      }
    }
    if [row_action_value] != "" or [row_action_type] != "" {
      mutate {
        replace => {
          "security_result.description" => "%{row_action_type} - %{row_action_value}"
        }
        on_error => "lbl_action_value_label_replace_failed"
      }
    }
    if [report_group_by] != "" {
      mutate {
        replace => {
          "report_group_by_label.key" => "groupBy"
          "report_group_by_label.value.string_value" => "%{report_group_by}"
        }
        on_error => "report_group_by_label_replace_failed"
      }
      if ![report_group_by_label_replace_failed] {
        mutate {
          merge => {
            "event1.idm.read_only_udm.additional.fields" => "report_group_by_label"
          }
          on_error => "report_group_by_label_merge_failed"
        }
      }
    }

    if [detail_group_by_value] != "" {
      mutate {
        replace => {
          "detail_group_by_value_label.key" => "groupByValue"
          "detail_group_by_value_label.value.string_value" => "%{detail_group_by_value}"
        }
        on_error => "detail_group_by_value_label_replace_failed"
      }
      if ![detail_group_by_value_label_replace_failed] {
        mutate {
          merge => {
            "event1.idm.read_only_udm.additional.fields" => "detail_group_by_value_label"
          }
          on_error => "detail_group_by_value_label_merge_failed"
        }
      }
    }
    if [row_object_type] != "" {
      mutate {
        replace => {
          "event1.idm.read_only_udm.target.resource.resource_subtype" => "%{row_object_type}"
          "target_data_present" => "true"
        }
        on_error => "lbl_object_type_label_replace_failed"
      }
    }
    if [row_object_name] != "" {
      mutate {
        replace => {
          "event1.idm.read_only_udm.target.resource.name" => "%{row_object_name}"
          "target_data_present" => "true"
          "has_target" => "true"
        }
        on_error => "lbl_object_name_label_replace_failed"
      }
    }
    if [security_result] != "" {
      mutate {
        merge => {
          "event1.idm.read_only_udm.security_result" => "security_result"
        }
        on_error => "security_result_merge_failed"
      }
    }
    if [has_user] == "true" and [target_data_present] == "true" {
      mutate {
        replace => {
          "event1.idm.read_only_udm.metadata.event_type" => "USER_LOGIN"
          "event1.idm.read_only_udm.extensions.auth.type" => "AUTHTYPE_UNSPECIFIED"
        }
      }
    }
    else if [has_principal] == "true" and [has_target] == "true" and [has_http] == "true" {
      mutate {
        replace => {
          "event1.idm.read_only_udm.metadata.event_type" => "NETWORK_HTTP"
        }
      }
    }
    else if [has_principal] == "true" and [has_target] == "true" {
      mutate {
        replace => {
          "event1.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
        }
      }
    }
    else if [has_user] == "true" {
      mutate {
        replace => {
          "event1.idm.read_only_udm.metadata.event_type" => "USER_UNCATEGORIZED"
        }
      }
    }
    else if [has_principal] == "true" {
      mutate {
        replace => {
          "event1.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
        }
      }
    }
    else {
      mutate {
        replace => {
          "event1.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
        }
      }
    }
    mutate {
      replace => {
        "event1.idm.read_only_udm.metadata.vendor_name" => "IBM B2B INTEGRATOR"
        "event1.idm.read_only_udm.metadata.product_name" => "IBM B2B INTEGRATOR"
      }
    }
    mutate {
      merge => {
        "@output" => "event1"
      }
    }
  }
  xml {
    source => "message"
    xpath => {
      "/DetailRow/CREDENTIAL_TYPE" => "credential_type"
      "/DetailRow/IS_AUTHENTICATED" => "is_authenticated"
      "/DetailRow/IS_COUNTERPARTY" => "is_counterparty"
      "/DetailRow/ENDPOINT1" => "endpoint1"
      "/DetailRow/ENDPOINT2" => "endpoint2"
      "/DetailRow/AUTHENTICATE_ID" => "authenticate_id"
      "/DetailRow/CREDENTIAL_VALUE" => "credential_value"
      "/DetailRow/ADAPTER_NAME" => "adapter_name"
      "/DetailRow/PRINCIPAL" => "principal_id"
      "/DetailRow/TIME" => "event_time"
      "/DetailRow/PROTOCOL" => "protocol"
      "/DetailRow/SESSION_ID" => "session_id"
    }
    on_error => "xml_parsing_failed"
  }

  if [xml_parsing_failed] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }

  if [event_time] != "" {
    date {
      match => ["event_time", "yyyy-MM-dd HH:mm:ss.S", "ISO8601"]
      target => "event.idm.read_only_udm.metadata.event_timestamp"
      on_error => "event_time_match_failed"
    }
  }

  if [endpoint1] != "" {
    grok {
      match => {
        "endpoint1" => "%{IP:endpoint1}"
      }
      overwrite => ["endpoint1"]
      on_error => "endpoint1_grok_failed"
    }
    if ![endpoint1_grok_failed] {
      mutate {
        merge => {
          "principal.ip" => "endpoint1"
          "principal.asset.ip" => "endpoint1"
        }
        on_error => "endpoint1_merge_failed"
      }
      if ![endpoint1_merge_failed] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
        }
      }
    }
    else {
      mutate {
        replace => {
          "principal.hostname" => "%{endpoint1}"
          "principal.asset.hostname" => "%{endpoint1}"
          "has_principal" => "true"
        }
        on_error => "endpoint1_replace_failed"
      }
    }
  }
  if [endpoint2] != "" {
    grok {
      match => {
        "endpoint2" => "%{IP:endpoint2}"
      }
      overwrite => ["endpoint2"]
      on_error => "endpoint2_grok_failed"
    }
    if ![endpoint2_grok_failed] {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.ip" => "endpoint2"
          "event.idm.read_only_udm.target.asset.ip" => "endpoint2"
        }
        on_error => "endpoint2_merge_failed"
      }
      if ![endpoint2_merge_failed] {
        mutate {
          replace => {
            "has_target" => "true"
            "target_data_present" => "true"
          }
        }
      }
    }
    else {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.hostname" => "%{endpoint2}"
          "event.idm.read_only_udm.target.asset.hostname" => "%{endpoint2}"
          "has_target" => "true"
          "target_data_present" => "true"
        }
      }
    }
  }

  if [principal_id] != "" {
    mutate {
      replace => {
        "principal.user.userid" => "%{principal_id}"
        "has_user" => "true"
      }
      on_error => "principal_id_mutate_failed"
    }
  }
  if [adapter_name] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.application" => "%{adapter_name}"
        "target_data_present" => "true"
      }
      on_error => "adapter_name_mutate_failed"
    }
  }

  if [is_authenticated] == "1" {
    mutate {
      replace => {
        "security_result_action" => "ALLOW"
      }
    }
  } else if [is_authenticated] == "0" {
    mutate {
      replace => {
        "security_result_action" => "BLOCK"
      }
    }
  }
  if [security_result_action] != "" {
    mutate {
      merge => {
        "security_result.action" => "security_result_action"
      }
      on_error => "security_result_action_merge_failed"
    }
  }
  mutate {
    convert => {
      "is_authenticated" => "string"
    }
    on_error => "is_authenticated_convert_failed"
  }
  if [is_counterparty] != "" {
    mutate {
      replace => {
        "is_counterparty_label.key" => "is_counterparty"
        "is_counterparty_label.value.string_value" => "%{is_counterparty}"
      }
      on_error => "is_counterparty_label_replace_failed"
    }
    if ![is_counterparty_label_replace_failed] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "is_counterparty_label"
        }
        on_error => "is_counterparty_label_merge_failed"
      }
    }
  }
  if [credential_value] != "" {
    mutate {
      replace => {
        "credential_value_label.key" => "credential_value"
        "credential_value_label.value.string_value" => "%{credential_value}"
      }
      on_error => "credential_value_label_replace_failed"
    }
    if ![credential_value_label_replace_failed] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "credential_value_label"
        }
        on_error => "credential_value_label_merge_failed"
      }
    }
  }
  if [authenticate_id] != "" {
    mutate {
      replace => {
        "authenticate_id_label.key" => "authenticate_id"
        "authenticate_id_label.value.string_value" => "%{authenticate_id}"
      }
      on_error => "authenticate_id_label_replace_failed"
    }
    if ![authenticate_id_label_replace_failed] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "authenticate_id_label"
        }
        on_error => "authenticate_id_label_merge_failed"
      }
    }
  }
  if [session_id] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.session_id" => "%{session_id}"
      }
      on_error => "session_id_failed"
    }
  }

  if [protocol] != "" {
    mutate {
      replace => {
        "protocol_name_label.key" => "protocol_name"
        "protocol_name_label.value.string_value" => "%{protocol}"
      }
      on_error => "protocol_name_label_replace_failed"
    }
    if ![protocol_name_label_replace_failed] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "protocol_name_label"
        }
        on_error => "protocol_name_label_merge_failed"
      }
    }
  }

  if [credential_type] != "" {
    mutate {
      replace => {
        "credential_type_label.key" => "credential_type"
        "credential_type_label.value.string_value" => "%{credential_type}"
      }
      on_error => "credential_type_label_replace_failed"
    }
    if ![credential_type_label_replace_failed] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "credential_type_label"
        }
        on_error => "credential_type_label_merge_failed"
      }
    }
  }

  if [has_user] == "true" and [target_data_present] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_LOGIN"
        "event.idm.read_only_udm.extensions.auth.type" => "AUTHTYPE_UNSPECIFIED"
      }
    }
  }
  else if [has_principal] == "true" and [has_target] == "true" and [has_http] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_HTTP"
      }
    }
  }
  else if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [has_user] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "IBM B2B INTEGRATOR"
      "event.idm.read_only_udm.metadata.product_name" => "IBM B2B INTEGRATOR"
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }
  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }
  if [event1] == "" {
    mutate {
      merge => {
        "@output" => "event"
      }
    }
  }
}
