# Product: IBM Tap Library
# Category: Monitoring
# Supported Format: Syslog
# Reference: https://www.ibm.com/tape-storage#:~:text=Read%20the%20IBM%20Tape%20Library,all%20critical%20to%20the%20business.
# Last Updated: 2024-05-02
# Copyright 2024 Chronicle LLC


filter {
  mutate {
    replace => {
      "timestamp" => ""
      "collected_timestamp" => ""
      "host" => ""
      "process_id" => ""
      "task_id" => ""
      "task_name" => ""
      "created_time" => ""
      "status" => ""
      "action_message" => ""
      "src_user" => ""
      "target_user" => ""
      "target_ip" => ""
      "target_port" => ""
      "proto" => ""
      "ssh_key" => ""
      "command" => ""
      "description" => ""
      "log_type" => ""
      "remaining_fields" => ""
      "security_result" => ""
    }
  }

  grok {
    match => {
      "message" => [
        "<%{INT}>%{SYSLOGTIMESTAMP:collected_timestamp}\\s+%{DATA:host}\\s+MI_TASK\\[%{INT:process_id}\\]:\\s+TASK\\s+ID:\\s+%{INT:task_id},\\s+TASK\\s+NAME:\\s+%{GREEDYDATA:task_name},\\s+USER\\s+NAME:\\s+%{WORD:target_user},\\s+TIME\\s+CREATED:\\s+(%{WORD}\\s+)?(?<created_time>(%{INT}-%{INT}-%{INT}-%{INT}\\.%{INT}\\.%{INT}\\.%{INT})|(%{WORD}\\s+%{INT}\\s+%{INT}\\.%{INT}\\.%{INT}\\s+%{WORD}\\s+%{INT})),\\s+STATUS:\\s+%{GREEDYDATA:status}",
        "<%{INT}>%{SYSLOGTIMESTAMP:timestamp}\\s+%{DATA:host}\\s+%{GREEDYDATA:remaining_fields}",
      ]
    }
    overwrite => ["collected_timestamp", "timestamp", "host", "process_id",
    "task_id", "task_name", "created_time", "status", "target_user",
    "remaining_fields"]
    on_error => "not_grok"
  }

  if ![not_grok] and [remaining_fields] != "" {
    grok {
      match => {
        "remaining_fields" => [
          "(?P<log_type>sshd)\\[%{INT:process_id}\\]:\\s+(%{GREEDYDATA:action_message}\\s+for %{USERNAME:src_user}\\s+from\\s+%{IPV4:target_ip}\\s+port\\s+%{INT:target_port}(\\s+%{WORD:proto}:\\s+RSA\\s+SHA256:%{GREEDYDATA:ssh_key})?|%{GREEDYDATA:action_message}\\s+from(\\s+user\\s+%{USERNAME:src_user})?\\s+%{IPV4:target_ip}\\s+port\\s+%{INT:target_port})",
          "syslog:\\s+%{GREEDYDATA:command}",
          "Tunnel\\s+Manager:\\s+%{INT}:\\s+%{GREEDYDATA:description}"
        ]
      }
      overwrite => ["process_id", "log_type", "action_message", "src_user",
      "target_ip", "target_port", "proto", "ssh_key", "command", "description"]
      on_error => "error_remaining_fields"
    }

    if [error_remaining_fields] {
      drop {
        tag => "TAG_MALFORMED_MESSAGE"
      }
    }
  }

  if [not_grok] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }

  if [collected_timestamp] != "" {
    date {
      match => ["collected_timestamp", "MMM dd HH:mm:ss", "MMM d HH:mm:ss"]
      target => "event.idm.read_only_udm.metadata.collected_timestamp"
      rebase => true
      on_error => "no_collected_timestamp"
    }
  }

  if [timestamp] != "" {
    date {
      match => ["timestamp", "MMM dd HH:mm:ss", "MMM d HH:mm:ss"]
      rebase => true
      on_error => "no_timestamp"
    }
  }

  if [created_time] != "" {
    mutate {
      gsub => ["created_time", "(.*).([0-9]{3})[0-9]{3}", "$1.$2"]
    }

    date {
      match => ["created_time",
      "yyyy-MM-dd-HH.mm.ss.SSS", "MMM dd HH.mm.ss ZZZ yyyy"]
      on_error => "error_created_time"
    }
  }

  if [host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{host}"
      }
      on_error => "error_host"
    }
  }

  if [process_id] != "" {
      mutate {
      replace => {
        "event.idm.read_only_udm.principal.process.pid" => "%{process_id}"
      }
      on_error => "error_process_id"
    }
  }

  if [target_user] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.userid" => "%{target_user}"
      }
      on_error => "error_target_username"
    }
  }

  if [src_user] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{src_user}"
      }
      on_error => "error_username"
    }
  }

  if [target_ip] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.ip" => "target_ip"
      }
      on_error => "error_target_ip"
    }
  }

  if [target_port] != "" {
    mutate {
      convert => {
        "target_port" => "integer"
      }
      on_error => "error_port_conversion"
    }

    if ![error_port_conversion] {
      mutate {
        rename => {
          "target_port" => "event.idm.read_only_udm.target.port"
        }
        on_error => "error_target_port"
      }
    }
  }

  if [proto] in ["ssh", "ssh2"] or [log_type] == "sshd" {
    mutate {
      replace => {
         "event.idm.read_only_udm.network.application_protocol" => "SSH"
      }
    }
  }

  mutate {
    replace => {
        "ssh_key_label.value.string_value" => "%{ssh_key}"
    }
    on_error => "no_ssh_key_label_found"
  }
  if ![no_ssh_key_label_found] and [ssh_key] != "" {
    mutate {
      replace => {
        "ssh_key_label.key" => "ssh_key"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "ssh_key_label"
      }
    }
  }

  if [command] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.process.command_line" => "%{command}"
      }
      on_error => "error_command_line"
    }
  }

  if [description] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{description}"
      }
      on_error => "error_description"
    }
  }

   if [task_id] != "" {
    mutate {
      replace => {
        "add_task_id.value.string_value" => "%{task_id}"
      }
      on_error => "no_task_id"
    }

    if ![no_task_id]
    and [add_task_id][value][string_value] != "" {
      mutate {
        replace => {
          "add_task_id.key" => "task_id"
        }
      }

      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "add_task_id"
        }
        on_error => "err_task_id_field"
      }
    }
  }

  if [task_name] != "" {
    mutate {
      gsub => ["task_name", "\\s*$", ""]
    }

    mutate {
      replace => {
        "security_result.summary" => "%{task_name}"
      }
      on_error => "error_summary"
    }
  }

  if [action_message] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{action_message}"
      }
      on_error => "error_action_message_summary"
    }
  }

  if [status] != "" {
    mutate {
      replace => {
        "security_result.action_details" => "%{status}"
      }
      on_error => "error_status"
    }
  }

  if [status] == "Successful" {
    mutate {
      replace => {
        "action" => "ALLOW"
      }
    }

    mutate{
      merge => {
        "security_result.action" => "action"
      }
    }
  }

  if [security_result] != "" {
    mutate {
       merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.product_name" => "IBM LTO"
      "event.idm.read_only_udm.metadata.vendor_name" => "IBM"
    }
  }

  if [status] =~ "(?i)success" and [task_name] =~ "(?i)Login" {
    mutate {
      replace => {
        "event.idm.read_only_udm.extensions.auth.type" => "AUTHTYPE_UNSPECIFIED"
      }
    }

    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_LOGIN"
      }
    }
  }
  else if [host] != "" and [target_ip] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      }
    }
  } else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }

  mutate{
  replace=>{
    "principal_hostname"=>"%{event.idm.read_only_udm.principal.hostname}"
  }
  on_error=>"no_principal_hostname"
}

mutate {
  replace => {
    "principal_asset_hostname" =>
    "%{event.idm.read_only_udm.principal.asset.hostname}"
  }
  on_error => "not_prsent_pricipal_asset_host"
}

if [not_prsent_pricipal_asset_host] and ![no_principal_hostname] and
[principal_hostname] != "" {
  mutate {
    replace => {
      "event.idm.read_only_udm.principal.asset.hostname" =>
      "%{principal_hostname}"
    }
  }
}

else if ![not_prsent_pricipal_asset_host] and [no_principal_hostname] and
[principal_asset_hostname] != "" {
  mutate {
    replace => {
      "event.idm.read_only_udm.principal.hostname" =>
      "%{principal_asset_hostname}"
    }
  }
}
else if ![not_prsent_pricipal_asset_host] and ![no_principal_hostname] and
([principal_hostname] != [principal_asset_hostname]) {
  mutate {
    replace => {
      "event.idm.read_only_udm.principal.asset.hostname" =>
      "%{principal_hostname}"
    }
  }
  mutate {
    replace => {
      "token_new" => ""
    }
  }
  mutate {
    replace => {
      "token_new.value" => "%{principal_asset_hostname}"
    }
    on_error => "no_filed_present"
  }
  if ![no_filed_present] and [token_new][value] != "" {
    mutate {
      replace => {
        "token_new.key" => "asset_host_name"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.asset.attribute.labels" =>
        "token_new"
      }
    }
  }
}

mutate{
  replace=>{
    "target_hostname"=>"%{event.idm.read_only_udm.target.hostname}"
  }
  on_error=>"no_target_hostname"
}

mutate {
  replace => {
    "target_asset_hostname" =>
    "%{event.idm.read_only_udm.target.asset.hostname}"
  }
  on_error => "not_prsent_target_asset_host"
}

if [not_prsent_target_asset_host] and ![no_target_hostname] and
[target_hostname] != "" {
  mutate {
    replace => {
      "event.idm.read_only_udm.target.asset.hostname" =>
      "%{target_hostname}"
    }
  }
}

else if ![not_prsent_target_asset_host] and [no_target_hostname] and
[target_asset_hostname] != "" {
  mutate {
    replace => {
      "event.idm.read_only_udm.target.hostname" =>
      "%{target_asset_hostname}"
    }
  }
}
else if ![not_prsent_target_asset_host] and ![no_target_hostname] and
([target_hostname] != [target_asset_hostname]) {
  mutate {
    replace => {
      "event.idm.read_only_udm.target.asset.hostname" =>
      "%{target_hostname}"
    }
  }
  mutate {
    replace => {
      "token_new" => ""
    }
  }
  mutate {
    replace => {
      "token_new.value" => "%{target_asset_hostname}"
    }
    on_error => "no_filed_present"
  }
  if ![no_filed_present] and [token_new][value] != "" {
    mutate {
      replace => {
        "token_new.key" => "device_host_name"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.target.asset.attribute.labels" =>
        "token_new"
      }
    }
  }
}


  mutate {
    merge=> {
      "@output" => "event"
    }
  }
}
