# Product: HPE
# Category: BladeSystem C7000
# Supported Format: SYSLOG
# Last Updated: 2024-04-08
# Copyright 2024 Chronicle LLC

filter {
    grok {
        match => {
            "message" => "<%{INT:priority_id}>%{SYSLOGTIMESTAMP:event_timestamp} %{NOTSPACE:hostname} %{DATA:command}: \\[%{WORD:component}:%{DATA:component_name}:%{NUMBER:internal_code}:%{WORD:severity}\\] %{GREEDYDATA:description}"
        }
        on_error => "grok_failed"
    }

    if ![grok_failed] {
        date {
            match => ["event_timestamp", "MMM dd HH:mm:ss", "MMM d HH:mm:ss"]
            rebase => true
            on_error => "time_not_present"
        }

        mutate {
            replace => {
                "metadata.event_type" => "GENERIC_EVENT"
                "metadata.vendor_name" => "HP"
                "metadata.product_name" => "HPE BladeSystem c7000"
            }
        }

        mutate {
            replace => {
                "priority_id_label.value.string_value" => "%{priority_id}"
            }
            on_error => "no_priority_id"
        }

        if ![no_priority_id] and
        [priority_id_label][value][string_value] != "" {
            mutate {
                replace => {
                    "priority_id_label.key" => "Priority Id"
                }
            }
            mutate {
                merge => {
                    "additional.fields" => "priority_id_label"
                }
            }
        }

        mutate {
            replace => {
                "internal_code_label.value.string_value" => "%{internal_code}"
            }
            on_error => "no_internal_code"
        }

        if ![no_internal_code] and
        [internal_code_label][value][string_value] != "" {
            mutate {
                replace => {
                    "internal_code_label.key" => "Internal Code"
                }
            }
            mutate {
                merge => {
                    "additional.fields" => "internal_code_label"
                }
            }
        }

        mutate {
            replace => {
                "component_name_label.value.string_value" => "%{component_name}"
            }
            on_error => "no_component_name"
        }

        if ![no_component_name] and
        [component_name_label][value][string_value] != "" {
            mutate {
                replace => {
                    "component_name_label.key" => "Component Name"
                }
            }
            mutate {
                merge => {
                    "additional.fields" => "component_name_label"
                }
            }
        }
        mutate {
            replace => {
                "metadata.product_event_type" => "%{component}"
            }
            on_error => "no_component_name"
        }

        if [description] != "" {
            grok {
                match => {
                    "description" => "%{DATA:description}\\s*:\\s*%{DATA:current_state}((,\\s*Previous:\\s*%{GREEDYDATA:previous_state},\\s*Cause:\\s*%{GREEDYDATA:cause})|(,\\s*Previous:\\s*%{GREEDYDATA:previous_state}))"
                }
                overwrite => ["description"]
                on_error => "no_desc_match"
            }

            if ![no_desc_match] {
                mutate {
                    replace => {
                        "current_state_label.value" => "%{current_state}"
                    }
                    on_error => "no_current_state"
                }

                if ![no_current_state] and [current_state_label][value] != "" {
                    mutate {
                        replace => {
                            "current_state_label.key" => "Current State"
                        }
                        on_error => "_"
                    }
                    mutate {
                        merge => {
                            "security_result.detection_fields" =>
                            "current_state_label"
                        }
                        on_error => "_"
                    }
                }

                mutate {
                    replace => {
                        "previous_state_label.value" => "%{previous_state}"
                    }
                    on_error => "no_previous_state"
                }

                if ![no_previous_state] and
                [previous_state_label][value] != "" {
                    mutate {
                        replace => {
                            "previous_state_label.key" => "Previous State"
                        }
                    }
                    mutate {
                        merge => {
                            "security_result.detection_fields" =>
                            "previous_state_label"
                        }
                        on_error => "_"
                    }
                }

                mutate {
                    replace => {
                        "cause_label.value" => "%{cause}"
                    }
                    on_error => "no_cause"
                }

                if ![no_cause] and [cause_label][value] != "" {
                    mutate {
                        replace => {
                            "cause_label.key" => "Cause"
                        }
                        on_error => "_"
                    }
                    mutate {
                        merge => {
                            "security_result.detection_fields" => "cause_label"
                        }
                        on_error => "_"
                    }
                }

            }
        }

        if [severity] == "Critical" {
            mutate {
                replace => {
                    "security_result.severity" => "CRITICAL"
                }
            }
        }
        else if [severity] == "Major" {
            mutate {
                replace => {
                    "security_result.severity" => "HIGH"
                }
            }
        }
        else if [severity] == "Warning" {
            mutate {
                replace => {
                    "security_result.severity" => "MEDIUM"
                }
            }
        }
        else if [severity] in ["Info", "Minor"] {
            mutate {
                replace => {
                    "security_result.severity" => "LOW"
                }
            }
        }
        else {
            mutate {
                replace => {
                    "security_result.severity" => "UNKNOWN_SEVERITY"
                }
            }
        }

        mutate {
            replace => {
                "security_result.description" => "%{description}"
            }
            on_error => "no_description"
        }

        mutate {
            replace => {
                "event.idm.read_only_udm.principal.process.command_line" =>
                "%{command}"
            }
            on_error => "no_process_name"
        }

        mutate {
            replace => {
                "event.idm.read_only_udm.principal.hostname" => "%{hostname}"
            }
            on_error => "no_principal_host"
        }

        mutate {
            merge => {
                "event.idm.read_only_udm.security_result" => "security_result"
            }
        }

    }
    else {
        drop {
            tag => "TAG_UNSUPPORTED"
        }
    }
    if ![no_principal_host] {
        mutate {
            replace => {
                "metadata.event_type" => "STATUS_UPDATE"
            }
        }
    }
    else {
        mutate {
            replace => {
                "metadata.event_type" => "GENERIC_EVENT"
            }
        }
    }

    mutate {
        rename => {
            "metadata" => "event.idm.read_only_udm.metadata",
            "additional" => "event.idm.read_only_udm.additional"
        }
    }
    mutate{
  replace=>{
    "principal_hostname"=>"%{event.idm.read_only_udm.principal.hostname}"
  }
  on_error=>"no_principal_hostname"
}

mutate {
  replace => {
    "principal_asset_hostname" =>
    "%{event.idm.read_only_udm.principal.asset.hostname}"
  }
  on_error => "not_prsent_pricipal_asset_host"
}

if [not_prsent_pricipal_asset_host] and ![no_principal_hostname] and
[principal_hostname] != "" {
  mutate {
    replace => {
      "event.idm.read_only_udm.principal.asset.hostname" =>
      "%{principal_hostname}"
    }
  }
}

else if ![not_prsent_pricipal_asset_host] and [no_principal_hostname] and
[principal_asset_hostname] != "" {
  mutate {
    replace => {
      "event.idm.read_only_udm.principal.hostname" =>
      "%{principal_asset_hostname}"
    }
  }
}
else if ![not_prsent_pricipal_asset_host] and ![no_principal_hostname] and
([principal_hostname] != [principal_asset_hostname]) {
  mutate {
    replace => {
      "event.idm.read_only_udm.principal.asset.hostname" =>
      "%{principal_hostname}"
    }
  }
  mutate {
    replace => {
      "token_new" => ""
    }
  }
  mutate {
    replace => {
      "token_new.value" => "%{principal_asset_hostname}"
    }
    on_error => "no_filed_present"
  }
  if ![no_filed_present] and [token_new][value] != "" {
    mutate {
      replace => {
        "token_new.key" => "asset_host_name"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.asset.attribute.labels" =>
        "token_new"
      }
    }
  }
}

mutate{
  replace=>{
    "target_hostname"=>"%{event.idm.read_only_udm.target.hostname}"
  }
  on_error=>"no_target_hostname"
}

mutate {
  replace => {
    "target_asset_hostname" =>
    "%{event.idm.read_only_udm.target.asset.hostname}"
  }
  on_error => "not_prsent_target_asset_host"
}

if [not_prsent_target_asset_host] and ![no_target_hostname] and
[target_hostname] != "" {
  mutate {
    replace => {
      "event.idm.read_only_udm.target.asset.hostname" =>
      "%{target_hostname}"
    }
  }
}

else if ![not_prsent_target_asset_host] and [no_target_hostname] and
[target_asset_hostname] != "" {
  mutate {
    replace => {
      "event.idm.read_only_udm.target.hostname" =>
      "%{target_asset_hostname}"
    }
  }
}
else if ![not_prsent_target_asset_host] and ![no_target_hostname] and
([target_hostname] != [target_asset_hostname]) {
  mutate {
    replace => {
      "event.idm.read_only_udm.target.asset.hostname" =>
      "%{target_hostname}"
    }
  }
  mutate {
    replace => {
      "token_new" => ""
    }
  }
  mutate {
    replace => {
      "token_new.value" => "%{target_asset_hostname}"
    }
    on_error => "no_filed_present"
  }
  if ![no_filed_present] and [token_new][value] != "" {
    mutate {
      replace => {
        "token_new.key" => "device_host_name"
      }
    }
    mutate {
      merge => {
        "event.idm.read_only_udm.target.asset.attribute.labels" =>
        "token_new"
      }
    }
  }
}

    mutate {
        merge => {
            "@output" => "event"
        }
    }

}
