# Product: SAP_BTP
# Category: SaaS Applications
# Supported Format: JSON
# Reference: NA
# Last Updated: 2024-07-19
# Copyright 2024 Chronicle LLC

filter {
  mutate {
    replace => {
      "host" => ""
      "role" => ""
      "time" => ""
      "user" => ""
      "userid" => ""
      "org_id" => ""
      "tenant" => ""
      "space_id" => ""
      "category" => ""
      "event_type" => ""
      "principal_ip" => ""
      "json_message" => ""
      "json_message_uuid" => ""
      "user_present" => ""
      "als_service_id" => ""
      "format_version" => ""
      "app_or_service_id" => ""
      "_raw" => ""
      "target" => ""
      "metadata" => ""
      "principal" => ""
      "security_result" => ""
      "principal_present" => "false"
      "target_resource_present" => "false"
      "json_message.uuid" => ""
      "json_message.data.user" => ""
      "json_message.data.origin" => ""
      "json_message.data.msgNo" => ""
      "json_message.data.msg_Id" => ""
      "json_message.attributes" => ""
      "json_message.id" => ""
      "json_message.data.version" => ""
      "json_message.data.json_message" => ""
      "custom_success" => ""
      "custom_type" => ""
      "custom_status" => ""
      "message_uuid" => ""
      "message_id" => ""
    }
  }


  mutate {
    gsub => ["message","message","json_message"]
  }

  json {
    source => "message"
    array_function => "split_columns"
    on_error => "not_json"
  }

  if [not_json] {
    mutate {
      gsub => ["message","},$","}"]
    }
    json {
      source => "message"
      array_function => "split_columns"
      on_error => "not_json"
    }
    if [not_json] {
      drop {
        tag => "TAG_UNSUPPORTED"
      }
    }
  }

  if [json_message_uuid] != "" {
    mutate {
      replace => {
        "metadata.product_log_id" => "%{json_message_uuid}"
      }
      on_error => "invalid_message_uuid"
    }
  }

  if [_raw] != "" {
    mutate {
      gsub => ["_raw","},$","}"]
    }
    json {
      source => "_raw"
      array_function => "split_columns"
      on_error => "invalid_json"
    }
  }

  if [time] != "" {
    date {
      match => ["time","ISO8601"]
      target => "metadata.event_timestamp"
      on_error => "invalid_date"
    }
  }

  if [host] != "" {
    mutate {
      replace => {
        "principal.hostname" => "%{host}"
        "principal.asset.hostname" => "%{host}"
      }
      on_error => "invalid_host"
    }
    if not [invalid_host] {
      mutate {
        replace => {
          "principal_present" => "true"
        }
      }
    }
  }

  if [user] != "" {
    mutate {
      replace => {
        "principal.user.user_display_name" => "%{user}"
      }
      on_error => "invalid_user"
    }
  }

  if [json_message] != "" {
    json {
      source => "json_message"
      array_function => "split_columns"
      target => "json_message"
      on_error => "invalid_json_message"
    }

    mutate {
      replace => {
        "principal_ip" => "%{json_message.ip}"
      }
      on_error => "ip_empty"
    }

    if not [ip_empty] and [principal_ip] != "" {
      grok {
        match => {
          "principal_ip" => "%{IP:principal_ip}"
        }
        overwrite => ["principal_ip"]
        on_error => "invalid_ip"
      }
      if not [invalid_ip] {
        mutate {
          merge => {
            "principal.ip" => "principal_ip"
            "principal.asset.ip" => "principal_ip"
          }
          on_error => "invalid_ip"
        }
        if not [invalid_ip] {
          mutate {
            replace => {
              "principal_present" => "true"
            }
          }
        }
      }
    }

    mutate {
      replace => {
        "userid" => "%{json_message.data_subject.id.userid}"
      }
      on_error => "userid_empty"
    }
    if not [userid_empty] and [userid] != "" {
      mutate {
        replace => {
          "principal.user.userid" => "%{json_message.data_subject.id.userid}"
        }
        on_error => "invalid_userid"
      }
      if not [invalid_userid] {
        mutate {
          replace => {
            "user_present" => "true"
          }
        }
      }
    }

    mutate {
      replace => {
        "role" => "%{json_message.data_subject.role}"
      }
      on_error => "invalid_role"
    }

    if not [invalid_role] and [role] =~ "admin" {
      mutate {
        replace => {
          "principal_user_role.type" => "ADMINISTRATOR"
        }
      }
      mutate {
        merge => {
          "principal.user.attribute.roles" => "principal_user_role"
        }
        on_error => "invalid_role"
      }
    }
    mutate {
      replace => {
        "message_uuid" => "%{json_message.uuid}"
      }
      on_error => "invalid_message_uuid"
    }
    if [message_uuid] != "" {
      mutate {
        replace => {
          "message_label_uuid.key" => "message_uuid"
          "message_label_uuid.value" => "%{json_message.uuid}"
        }
        on_error => "invalid_message_label_uuid"
      }
      if  ![invalid_message_label_uuid] {
        mutate {
          merge => {
            "security_result.detection_fields" => "message_label_uuid"
          }
          on_error => "invalid_message_label_uui"
        }
      }
    }
    mutate {
      replace => {
        "message_id" => "%{json_message.id}"
      }
      on_error => "invalid_message_id"
    }
    if [message_id] != "" {
      mutate {
        replace => {
          "message_id_label.key" => "message_id"
          "message_id_label.value" => "%{json_message.id}"
        }
        on_error => "invalid_message_label"
      }
      if not [invalid_message_label] {
        mutate {
          merge => {
            "security_result.detection_fields" => "message_id_label"
          }
          on_error => "invalid_message_id"
        }
      }
    }
    mutate {
      convert => {
        "json_message.customDetails.success" => "string"
      }
      on_error => "invalid_convert_success"
    }
    mutate {
      replace => {
        "custom_success" => "%{json_message.customDetails.success}"
      }
      on_error => "invalid_custom_success"
    }
    if [custom_success] != "" {
      mutate {
        replace => {
          "custom_success_label.key" => "customDetails_success"
          "custom_success_label.value" => "%{json_message.customDetails.success}"
        }
        on_error => "invalid_custom_success"
      }
      if not [invalid_custom_success] {
        mutate {
          merge => {
            "security_result.detection_fields" => "custom_success_label"
          }
          on_error => "invalid_custom_success"
        }
      }
    }
    mutate {
      replace => {
        "custom_type" => "%{json_message.customDetails.type}"
      }
      on_error => "invalid_custom_type"
    }
    if [custom_type] != "" {
      mutate {
        replace => {
          "custom_type_label.key" => "customDetails_type"
          "custom_type_label.value" => "%{json_message.customDetails.type}"
        }
        on_error => "invalid_custom_type"
      }
      if not [invalid_custom_type] {
        mutate {
          merge => {
            "security_result.detection_fields" => "custom_type_label"
          }
          on_error => "invalid_custom_type"
        }
      }
    }
    mutate {
      replace => {
        "custom_status" => "%{json_message.customDetails.status}"
      }
      on_error => "invalid_custom_status"
    }
    if [custom_status] != "" {
      mutate {
        replace => {
          "custom_status_label.key" => "customDetails_status"
          "custom_status_label.value" => "%{json_message.customDetails.status}"
        }
        on_error => "invalid_custom_status"
      }
      if not [invalid_custom_status] {
        mutate {
          merge => {
            "security_result.detection_fields" => "custom_status_label"
          }
          on_error => "invalid_custom_status"
        }
      }
    }
    for attri in json_message.customDetails.attributes {
      for key,value in attri map {
        mutate {
          replace => {
            "attri_label" => ""
          }
        }
        if [key] != "" {
          mutate {
            replace => {
              "attri_label.key" => "%{key}"
              "attri_label.value" => "%{value}"
            }
            on_error => "invalid_attri"
          }
          if ![invalid_attri] {
            mutate {
              merge => {
                "security_result.detection_fields" => "attri_label"
              }
              on_error => "invalid_attri_label"
            }
          }
        }
      }
    }
    json {
      source => "json_message.data"
      array_function => "split_columns"
      target => "json_message.data"
      on_error => "data_empty"
    }
    if not [data_empty] {
      for key,value in json_message.data {
        mutate {
          replace => {
            "message_label" => ""
          }
        }
        if [key] == "ip" {
          grok {
            match => {
              "value" => "%{IP:value}"
            }
            on_error => "not_ip"
            overwrite => ["value"]
          }
          if not [not_ip] {
            mutate {
              merge => {
                "principal.ip" => "value"
                "principal.asset.ip" => "value"
              }
              on_error => "invalid_ip"
            }
            if not [invalid_ip] {
              mutate {
                replace => {
                  "principal_present" => "true"
                }
              }
            }
          }
        } else if [key] == "json_message" {
          mutate {
            replace => {
              "message_label.key" => "message"
              "message_label.value" => "%{value}"
            }
            on_error => "invalid_message"
          }
          if not [invalid_message] {
            mutate {
              merge => {
                "security_result.detection_fields" => "message_label"
              }
              on_error => "invalid_message_label"
            }
          }
        } else if [key] == "level" {
            if [value] in ["ERROR", "CRITICAL"] {
              mutate {
                replace => {
                  "security_result.severity" => "%{value}"
                }
              }
            } else if [value] == "INFO" {
               mutate {
                replace => {
                  "security_result.severity" => "INFORMATIONAL"
                }
              }
            }
            else if [value] == "WARN" {
               mutate {
                replace => {
                  "security_result.severity" => "MEDIUM"
                }
              }
            }
            else {
               mutate {
                replace => {
                  "security_result.severity" => "UNKNOWN_SEVERITY"
                }
              }
            }
        }
      }
      mutate {
        replace => {
          "level" => "%{json_message.data.level}"
        }
        on_error => "invalid_level"
      }
      if ![invalid_level] {
        if [level] == "INFO"{
          mutate {
            replace => {
              "security_result.severity" => "INFORMATIONAL"
            }
          }
        }else{
          mutate {
            replace => {
              "security_result.severity_details" => "%{level}"
            }
            on_error => "invalid_severity_details"
          }
        }
      }

      mutate {
        convert => {
          "json_message.data.msgNo" => "string"
        }
        on_error => "invalid_convert_msgno"
      }
      mutate {
        replace => {
          "msgno" => "%{json_message.data.msgNo}"
        }
        on_error => "invalid_msgno"
      }
      if ![invalid_msgno] {
        mutate {
          replace => {
            "message_label_msgNo.key" => "msgNo"
            "message_label_msgNo.value" => "%{msgno}"
          }
          on_error => "invalid_message"
        }
        if not [invalid_message] {
          mutate {
            merge => {
              "security_result.detection_fields" => "message_label_msgNo"
            }
            on_error => "invalid_message_label_msgNo"
          }
        }
      }
      mutate {
        replace => {
          "msgId" => "%{json_message.data.msgId}"
        }
        on_error => "invalid_msgId"
      }
      if ![invalid_msgId] {
        mutate {
          convert => {
            "json_message.data.msgId" => "string"
          }
          on_error => "invalid_msgId"
        }
        mutate {
          replace => {
            "message_label_msgId.key" => "msgId"
            "message_label_msgId.value" => "%{json_message.data.msgId}"
          }
          on_error => "invalid_message"
        }
        if not [invalid_message] {
          mutate {
            merge => {
              "security_result.detection_fields" => "message_label_msgId"
            }
            on_error => "invalid_message_label_msgId"
          }
        }
      }
      mutate {
        replace => {
          "data_message" => "%{json_message.data.json_message}"
        }
        on_error => "invalid_data_message"
      }
      if [invalid_data_message] {
        grok {
          match => {
            "data_message" => "%{DATA:desc}: principal=%{DATA:principal_value}, %{GREEDYDATA}"
          }
          on_error => "invalid_json_message"
        }
        mutate {
          replace => {
            "desc_label.key" => "message"
            "desc_label.value" => "%{desc}"
          }
          on_error => "invalid_desc"
        }
        if not [invalid_desc] {
          mutate {
            merge => {
              "security_result.detection_fields" => "desc_label"
            }
            on_error => "invalid_desc_label"
          }
        }
        mutate {
          replace => {
            "message_label_json_message.key" => "principal"
            "message_label_json_message.value" => "%{principal_value}"
          }
          on_error => "invalid_message"
        }
        if not [invalid_message] {
          mutate {
            merge => {
              "security_result.detection_fields" => "message_label_json_message"
            }
            on_error => "invalid_message_label_json_message"
          }
        }
      }
      mutate {
        replace => {
          "version" => "%{json_message.data.version}"
        }
        on_error => "invalid_version"
      }
      if ![invalid_version] {
        mutate {
          replace => {
            "message_label_version.key" => "version"
            "message_label_version.value" => "%{json_message.data.version}"
          }
          on_error => "invalid_version"
        }
        if not [invalid_version] {
          mutate {
            merge => {
              "security_result.detection_fields" => "message_label_version"
            }
            on_error => "invalid_version_label"
          }
        }
      }

    }
    for key,value in json_message.object map {
      mutate {
        replace => {
          "attribute_label" => ""
        }
      }
      if [key] != "id" {
        mutate {
          replace => {
            "attribute_label.key" => "object_%{key}"
            "attribute_label.value" => "%{value}"
          }
          on_error => "invalid_attribute"
        }
        if not [invalid_attribute] {
          mutate {
            merge => {
              "security_result.detection_fields" => "attribute_label"
            }
            on_error => "invalid_attribute_label"
          }
        }
      } else {
        for key1,value1 in value map {
          mutate {
            replace => {
              "attribute_label1" => ""
            }
          }
          if [key1] == "clusterID" {
            mutate {
              replace => {
                "target.resource.product_object_id" => "%{value1}"
              }
              on_error => "invalid_clusterid"
            }
            if not [invalid_clusterid] {
              mutate {
                replace => {
                  "target.resource.resource_type" => "CLUSTER"
                  "target_resource_present" => "true"
                }
              }
            }
          } else {
            mutate {
              replace => {
                "attribute_label1.key" => "object_%{key}_%{key1}"
                "attribute_label1.value" => "%{value1}"
              }
              on_error => "invalid_attribute"
            }
            if not [invalid_attribute] {
              mutate {
                merge => {
                  "security_result.detection_fields" => "attribute_label1"
                }
                on_error => "invalid_attribute_label"
              }
            }
          }
        }
      }
    }

    for attribute in json_message.attributes {
      for key,value in attribute map {
        mutate {
          replace => {
            "attribute_label" => ""
          }
        }
        if [key] not in ["new","old"] {
          mutate {
            replace => {
              "attribute_label.key" => "%{key}"
              "attribute_label.value" => "%{value}"
            }
            on_error => "invalid_attribute"
          }
          if not [invalid_attribute] {
            mutate {
              merge => {
                "security_result.detection_fields" => "attribute_label"
              }
              on_error => "invalid_attribute_label"
            }
          }
        } else if [key] in ["new","old"] {
          json {
            source => "value"
            array_function => "split_columns"
            target => "value"
            on_error => "not_json"
          }

          if [not_json] {
            mutate {
              replace => {
                "attribute_label.key" => "%{key}"
                "attribute_label.value" => "%{value}"
              }
              on_error => "invalid_attribute"
            }
            if not [invalid_attribute] {
              mutate {
                merge => {
                  "security_result.detection_fields" => "attribute_label"
                }
                on_error => "invalid_attribute_label"
              }
            }
          } else {
            for key1,value1 in value map {
              if [key1] == "emails" {
                for email in value1 {
                  for key2,value2 in email map {
                    if [key2] == "value" and [value2] =~ "^.+@.+$" {
                      mutate {
                        merge => {
                          "principal.user.email_addresses" => "value2"
                        }
                        on_error => "invalid_email"
                      }
                      if not [invalid_email] {
                        mutate {
                          replace => {
                            "user_present" => "true"
                          }
                        }
                      }
                    }
                  }
                }
              } else {
                mutate {
                  replace => {
                    "attribute_label" => ""
                  }
                }
                mutate {
                  convert => {
                    "value1" => "string"
                  }
                  on_error => "conversion_failure"
                }
                mutate {
                  replace => {
                    "attribute_label.key" => "%{key}_%{key1}"
                    "attribute_label.value" => "%{value1}"
                  }
                  on_error => "invalid_attribute"
                }
                if not [invalid_attribute] {
                  mutate {
                    merge => {
                      "security_result.detection_fields" => "attribute_label"
                    }
                    on_error => "invalid_attribute_label"
                  }
                }
                if [key1] == "userName" {
                  if [value1] =~ "^.+@.+$" {
                    mutate {
                      merge => {
                        "principal.user.email_addresses" => "value1"
                      }
                      on_error => "invalid_email"
                    }
                    if not [invalid_email] {
                      mutate {
                        replace => {
                          "user_present" => "true"
                        }
                      }
                    }
                  } else {
                    mutate {
                      replace => {
                        "principal.user.userid" => "%{value1}"
                      }
                      on_error => "invalid_value"
                    }
                    if not [invalid_value] {
                      mutate {
                        replace => {
                          "user_present" => "true"
                        }
                      }
                    }
                  }
                }
              }
            }
          }
        }
      }
    }
  }

  if [app_or_service_id] != "" {
    mutate {
      replace => {
        "app_or_service_id_label.key" => "app_or_service_id"
        "app_or_service_id_label.value" => "%{app_or_service_id}"
      }
      on_error => "invalid_app_or_service_id"
    }
    if not [invalid_app_or_service_id] {
      mutate {
        merge => {
          "security_result.detection_fields" => "app_or_service_id_label"
        }
        on_error => "invalid_app_or_service_id_label"
      }
    }
  }

  if [als_service_id] != "" {
    mutate {
      replace => {
        "als_service_id_label.key" => "als_service_id"
        "als_service_id_label.value" => "%{als_service_id}"
      }
      on_error => "invalid_als_service_id"
    }
    if not [invalid_als_service_id] {
      mutate {
        merge => {
          "security_result.detection_fields" => "als_service_id_label"
        }
        on_error => "invalid_als_service_id_label"
      }
    }
  }

  if [format_version] != "" {
    mutate {
      replace => {
        "format_version_label.key" => "format_version"
        "format_version_label.value" => "%{format_version}"
      }
      on_error => "invalid_format_version"
    }
    if not [invalid_format_version] {
      mutate {
        merge => {
          "security_result.detection_fields" => "format_version_label"
        }
        on_error => "invalid_format_version_label"
      }
    }
  }

  if [org_id] != "" {
    mutate {
      replace => {
        "org_id_label.key" => "org_id"
        "org_id_label.value" => "%{org_id}"
      }
      on_error => "invalid_org_id"
    }
    if not [invalid_org_id] {
      mutate {
        merge => {
          "security_result.detection_fields" => "org_id_label"
        }
        on_error => "invalid_org_id_label"
      }
    }
  }

  if [space_id] != "" {
    mutate {
      replace => {
        "space_id_label.key" => "space_id"
        "space_id_label.value" => "%{space_id}"
      }
      on_error => "invalid_space_id"
    }
    if not [invalid_space_id] {
      mutate {
        merge => {
          "security_result.detection_fields" => "space_id_label"
        }
        on_error => "invalid_space_id_label"
      }
    }
  }

  if [tenant] != "" {
    mutate {
      replace => {
        "tenant_label.key" => "tenant"
        "tenant_label.value" => "%{tenant}"
      }
      on_error => "invalid_tenant"
    }
    if not [invalid_tenant] {
      mutate {
        merge => {
          "security_result.detection_fields" => "tenant_label"
        }
        on_error => "invalid_tenant_label"
      }
    }
  }

  if [category] != "" {
    mutate {
      merge => {
        "security_result.category_details" => "category"
      }
      on_error => "invalid_category"
    }
  }

  mutate {
    replace => {
      "metadata.product_name" => "SAP_BTP"
      "metadata.vendor_name" => "SAP_BTP"
      "metadata.event_type" => "GENERIC_EVENT"
    }
  }

  if [user_present] == "true" and [target_resource_present] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_RESOURCE_ACCESS"
      }
    }
  } else if [principal_present] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "STATUS_UPDATE"
      }
    }
  } else if [user_present] == "true" {
    mutate {
      replace => {
        "metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }

  if [metadata] != "" {
    mutate {
      rename => {
        "metadata" => "event.idm.read_only_udm.metadata"
      }
    }
  }

  if [principal] != "" {
    mutate {
      rename => {
        "principal" => "event.idm.read_only_udm.principal"
      }
    }
  }

  if [target] != "" {
    mutate {
      rename => {
        "target" => "event.idm.read_only_udm.target"
      }
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "invalid_security_result"
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
