# Product: SNOOPY_LOGGER
# Category: Log Aggregator
# Supported Format: SYSLOG
# Reference: https://github.com/a2o/snoopy/blob/master/etc/snoopy.ini.in
# Last Updated: 2022-08-10
# Copyright 2022 Chronicle LLC


filter {
  mutate {
    replace => {
      "time" => ""
      "host" => ""
      "application" => ""
      "pid" => ""
      "filensame" => ""
      "kv_data" => ""
      "desc" => ""
      "ppid" => ""
      "uid" => ""
      "cwd" => ""
      "filename" => ""
      "src_ip" => ""
      "src_port" => ""
      "response_code" => ""
      "user_agent" =>  ""
      "url" => ""
      "method" => ""
      "target_url" => ""
      "protocol" => ""
      "target_host" => ""
      "summary" => ""
      "security_result" => ""
    }
  }


  grok {
    match => {
      "message" => ["<%{INT}>%{SYSLOGTIMESTAMP:time} %{HOSTNAME:host} %{WORD:application}\\[%{INT:pid}\\]: \\[%{GREEDYDATA:kv_data}\\]: %{GREEDYDATA}",
                    '<%{INT}>%{SYSLOGTIMESTAMP:time} %{HOSTNAME:host} %{WORD:application}\\[%{INT:pid}\\]: %{IP:src_ip}:%{INT:src_port} \\[%{GREEDYDATA}\\] %{DATA} %{HOSTNAME:target_host}%{GREEDYDATA} %{INT:response_code} %{INT} %{GREEDYDATA} \\{%{DATA:user_agent}\\|\\|\\|\\|%{DATA:url}\\} \\\"%{WORD:method} %{DATA:target_url} %{GREEDYDATA:protocol}\\\"',
                    "<%{INT}>%{SYSLOGTIMESTAMP:time} %{HOSTNAME:host} %{WORD:application}\\[%{INT:pid}\\]: (%{GREEDYDATA:desc}, reason: %{DATA:summary}, code: %{INT:response_code}, info: \\\"%{WORD:status}\\\", %{GREEDYDATA}|%{GREEDYDATA:desc})"
                    ]
              }
    overwrite => ["time","host","application","pid","kv_data","desc","target_host", "application", "src_port", "response_code", "user_agent", "url", "method", "target_url", "protocol", "src_ip", "summary"]
  }

  if [time] != "" {
    date {
      match => [
          "time", "MMM dd HH:mm:ss ", "MMM  d HH:mm:ss", "RFC3339"
      ]
      rebase => true
      on_error => "time_not_present"
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
    }
  }

  if [host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{host}"
      }
    }
  }

  mutate {
    replace => {
      "fields.key" => "Status"
      "fields.value.string_value" => "%{status}"
    }
    on_error => "status_not_found"
  }
  if ![status_not_found] {
    mutate {
      merge => {
        "event.idm.read_only_udm.additional.fields" => "fields"
      }
    }
  }

  if [summary] != "" {
    mutate {
      replace => {
        "security_result.summary" => "%{summary}"
      }
    }
  }

  if [method] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.method" => "%{method}"
      }
    }
  }

  if [user_agent] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.user_agent" => "%{user_agent}"
      }
    }
  }

  if [target_url] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.url" => "%{target_url}"
      }
    }
  }

  if [protocol] =~ "HTTP" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.application_protocol" => "HTTP"
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_HTTP"
      }
    }
  }

  if [target_host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.hostname" => "%{target_host}"
      }
    }
  }

  if [url] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.referral_url" => "%{url}"
      }
    }
  }

  if [response_code] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.network.http.response_code" => "%{response_code}"
      }
      convert => {
        "event.idm.read_only_udm.network.http.response_code" => "integer"
      }
    }
  }

  if [src_port] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.port" => "%{src_port}"
      }
      convert => {
        "event.idm.read_only_udm.principal.port" => "integer"
      }
    }
  }

  if [src_ip] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.principal.ip" => "src_ip"
      }
    }
  }

  if [pid] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.pid" => "%{pid}"
      }
    }
  }

  if [application] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.application" => "%{application}"
      }
    }
  }

  if [kv_data] != "" {
    kv {
      source => "kv_data"
      field_split => " "
      value_split => ":"
    }
  }

  if [ppid] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.parent_process.pid" => "%{ppid}"
      }
    }
  }

  if [uid] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_log_id" => "%{uid}"
      }
    }
  }

  if [cwd] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.command_line" => "%{cwd}"
      }
    }
  }

  if [filename] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.file.full_path" => "%{filename}"
        "event.idm.read_only_udm.metadata.event_type" => "FILE_UNCATEGORIZED"
      }
    }
  }

  if [desc] != "" {
    grok {
      match => {
        "desc" => "Server %{DATA:server_name} is %{WORD}"
      }
      on_error => "no_server_name"
    }
    if ![no_server_name] {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.asset.type" => "SERVER"
          "event.idm.read_only_udm.principal.asset.hostname" => "%{server_name}"
        }
      }
    } else {
      mutate {
        replace => {
          "event.idm.read_only_udm.metadata.description" => "%{desc}"
        }
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.product_name" => "SNOOPY_LOGGER"
      "event.idm.read_only_udm.metadata.vendor_name" => "SNOOPY_LOGGER"
    }
  }

  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
    }
  }

  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
