# Product: Comodo
# Category: AV / Endpoint
# Supported Format: SYSLOG + KV (CEF)
# Reference: https://www.netsurion.com/Corporate/media/Corporate/Files/Support-Docs/Integration-Guide-Comodo-Endpoint-Protection.pdf
# Last Updated: 2021-04-09
# Copyright 2021 Chronicle LLC


filter {
  mutate {
    replace => {
      "event_type" => "SCAN_HOST"
      "filePath" => ""
      "suser" => ""
      "fname" => ""
    }
  }

  grok {
    match => {
      "message" => ["%{DATA} %{TIMESTAMP_ISO8601:datetime} %{GREEDYDATA} - - (?P<data>([^|]*))\\|(?P<data1>([^|]*))\\|(?P<data2>([^|]*))\\|(?P<data3>([^|]*))\\|(?P<data4>([^|]*))\\|(?P<data5>([^|]*))\\|(?P<data6>([^|]*))\\|(?P<data7>([^|]*))"]
    }
  }

  date {
    match => ["datetime", "ISO8601"]
  }

  if [data7] != "" {
    kv {
      source => "data7"
      trim_value => " "
      trim_key => " "
      value_split => "="
      field_split => " "
    }
  }

  if [filePath] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.file.full_path" => "%{filePath}"
        "event_type" => "SCAN_FILE"
      }
    }
  }
  if [fname] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.process.parent_process.file.full_path" => "%{fname}"
      }
    }
  }
  if [suser] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.userid" => "%{suser}"
      }
    }
  }

  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "COMODO"
      "event.idm.read_only_udm.metadata.product_name" => "COMODO_AV"
      "event.idm.read_only_udm.principal.asset.platform_software.platform_version" => "%{data3}"
      "event.idm.read_only_udm.principal.hostname" => "%{dvchost}"
      "event.idm.read_only_udm.principal.application" => "%{data5}"
      "event.idm.read_only_udm.principal.user.product_object_id" => "%{data4}"
    }
  }
  mutate {
    merge => {
      "event.idm.read_only_udm.principal.ip" => "dvc"
    }
  }
  if [event_type] != "" {
    mutate {
      rename => {
        "event_type" => "event.idm.read_only_udm.metadata.event_type"
      }
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
