# Product: Symantec Web Isolation
# Category: Secure Access Service Edge
# Supported Format: JSON
# Reference: https://techdocs.broadcom.com/content/dam/broadcom/techdocs/symantec-security-software/[…]/generated-pdfs/STIP-AdminGuide-v1.14-24AUG20-RELEASED.pdf
# Last Updated: 2023-11-28
# Copyright 2023 Chronicle LLC


filter {
  mutate {
    replace => {
      "referer_url" => ""
      "_security_result" => ""
      "_principal" => ""
      "_target" => ""
      "_network" => ""
      "_metadata" => ""
      "_intermediary" => ""
      "request_method" => ""
      "traceId" => ""
      "data.message_data" => ""
      "event_type" => ""
      "device" => ""
      "x-nauthilus-traceid" => ""
      "user_download_usage_bytes" => ""
      "user_upload_usage_bytes" => ""
      "user_total_usage_bytes" => ""
      "file_type" => ""
      "nauthilusId" => ""
      "resource_response_headers.x-nauthilus-traceid" => ""
      "utub" => ""
      "sandbox" => ""
      "fn" => ""
      "ft" => ""
      "session_id" => ""
      "createdAt" => ""
      "creationDate" => ""
      "data.properties.hostname.str" => ""
      "data.properties.environment.str" => ""
      "properties.hostname" => ""
      "properties.environment" => ""
      "hostname.str" => ""
      "data.level" => ""
      "level" => ""
      "inner_msg" => ""
      "cdate" => ""
      "userid" => ""
      "total_bytes" => ""
      "event_data" => ""
      "url" => ""
      "has_target_data" => "false"
      "has_principal_data" => "false"
      "message_data" => ""
    }
  }

  mutate {
    gsub => ["message", "message", "message_data"]
  }
  json {
    source => "message"
    on_error => "invalid_json_format"
  }

  if [invalid_json_format] {
    drop {
      tag => "TAG_MALFORMED_ENCODING"
    }
  }

  mutate {
    replace => {
      "_metadata.vendor_name" => "Broadcom Inc."
      "_metadata.product_name" => "Symantec Web Isolation"
    }
    on_error => "_no_metadata_vendor_product"
  }

  # DATA TRACE MESSAGES
  if [traceId] != "" or [data][message_data] != "" or [message_data] != "" {
    if [data][message_data] != "" {
      grok {
        match => {
          "data.message_data" => [
            "(?P<inner_msg>\\{.*\\})"
          ]
        }
        on_error => "no_message_UpsilonEvent"
        overwrite => ["inner_msg"]
      }
    }
    else if [message_data] != "" {
      grok {
        match => {
          "message_data" => [
            "(?P<inner_msg>\\{.*\\})"
          ]
        }
        on_error => "no_message_EpsilonEvent"
        overwrite => ["inner_msg"]
      }
    }

    json {
      source => "inner_msg"
      on_error => "not_json"
    }

    if [not_json] {
      drop {
        tag => "TAG_MALFORMED_ENCODING"
      }
    }

    if [createdAt] != "" {
      mutate {
        convert => {
          "createdAt" => "string"
        }
        on_error => "no_createdAt"
      }
      grok {
        match => {
          "createdAt" => "(?P<cdate>.{13})"
        }
        on_error => "no_date"
        overwrite => ["cdate"]
      }
    }
    else if [creationDate] != "" {
      mutate {
        convert => {
          "creationDate" => "string"
        }
        on_error => "no_creationDate"
      }
      grok {
        match => {
          "creationDate" => "(?P<cdate>.{13})"
        }
        on_error => "no_date"
        overwrite => ["cdate"]
      }
    }
    if [cdate] != "" {
      date {
        match => ["cdate", "UNIX_MS"]
        on_error => "no_cdate"
      }
    }

    # event
    mutate {
      replace => {
        "_metadata.product_event_type" => "%{event}"
      }
      on_error => "no_product_event_type"
    }

    mutate {
      replace => {
        "_metadata.product_log_id" => "%{traceId}"
      }
      on_error => "no_product_log_id"
    }

    # event

    # principal
    mutate {
      merge => {
        "_principal.ip" => "source_ip"
      }
      on_error => "no_source_ip"
    }
    if ![no_source_ip] {
      mutate {
        replace => {
          "has_principal_data" => "true"
        }
      }
    }
    mutate {
      merge => {
        "_principal.ip" => "original_source_ip"
      }
      on_error => "no_original_source_ip"
    }
    if ![no_original_source_ip] {
      mutate {
        replace => {
          "has_principal_data" => "true"
        }
      }
    }

    mutate {
      replace => {
        "_principal.location.country_or_region" => "%{source_ip_country_name}"
      }
      on_error => "no_source_ip_country_name"
    }

    mutate {
      convert => {
        "source_port" => "integer"
      }
      on_error => "_no_source_port"
    }

    if ![_no_source_port] {
      mutate {
        rename => {
          "source_port" => "_principal.port"
        }
        on_error => "no_source_port"
      }
    }

    mutate {
      replace => {
        "_target.url" => "%{url}"
      }
      on_error => "no_url"
    }
    if ![no_url] {
      mutate {
        replace => {
          "has_target_data" => "true"
        }
      }
    }
    mutate {
      replace => {
        "_principal.user.user_display_name" => "%{username}"
      }
      on_error => "no_username"
    }
    mutate {
      replace => {
        "_principal.hostname" => "%{url_host}"
      }
      on_error => "no_url_host"
    }
    if ![no_url_host] {
      mutate {
        replace => {
          "has_principal_data" => "true"
        }
      }
    }
    mutate {
      replace => {
        "_principal.application" => "%{service}"
      }
      on_error => "no_service"
    }
    mutate {
      replace => {
        "_network.session_id" => "%{session_id}"
      }
      on_error => "no_session_id"
    }
    mutate {
      replace => {
        "_network.parent_session_id" => "%{isolation_session_id}"
      }
      on_error => "no_isolation_session_id"
    }
    if [event] =~ "Clipboard" and [url] != "" {
      grok {
        match => {
          "url" => [
            "/services/%{DATA:sandbox_val}/.*"
          ]
        }
        on_error => "grok_error_sandbox"
      }
      if ![grok_error_sandbox] {
        mutate {
          replace => {
            "sandbox.value" => "%{sandbox_val}"
            "sandbox.key" => "Sandbox"
          }
          on_error => "no_sandbox"
        }
        mutate {
          merge => {
            "about.labels" => "sandbox"
            "about.resource.attribute.labels" => "sandbox"
          }
          on_error => "no_sandbox"
        }
        mutate {
          merge => {
            "event1.idm.read_only_udm.about" => "about"
          }
          on_error => "no_about"
        }
      }
    }

    if [resource_response_headers][x-nauthilus-traceid] != "" {
      mutate {
        replace => {
          "_network.community_id" => "%{resource_response_headers.x-nauthilus-traceid}"
        }
        on_error => "no_traceId"
      }
    }

    if [user_download_usage_bytes] != "" {
      mutate {
        convert => {
          "user_download_usage_bytes" => "uinteger"
        }
        on_error => "no_user_download_usage_bytes"
      }
      if ![no_user_download_usage_bytes] {
        mutate {
          rename => {
            "user_download_usage_bytes" => "_network.received_bytes"
          }
        }
      }
    }
    if [user_upload_usage_bytes] != "" {
      mutate {
        convert => {
          "user_upload_usage_bytes" => "uinteger"
        }
        on_error => "no_user_upload_usage_bytes"
      }
      if ![no_user_upload_usage_bytes] {
        mutate {
          rename => {
            "user_upload_usage_bytes" => "_network.sent_bytes"
          }
        }
      }
    }
    if [user_total_usage_bytes] != "" {
      mutate {
        convert => {
          "user_total_usage_bytes" => "string"
        }
        on_error => "no_user_total_usage_bytes"
      }
      if ![no_user_total_usage_bytes] {
        mutate {
          replace => {
            "utub.value" => "%{user_total_usage_bytes}"
            "utub.key" => "user_total_usage_bytes"
          }
          on_error => "no_user_total_usage_bytes"
        }

        mutate {
          merge => {
            "about.labels" => "utub"
            "about.resource.attribute.labels" => "utub"
          }
          on_error => "no_user_total_usage_bytes"
        }
        mutate {
          merge => {
            "event1.idm.read_only_udm.about" => "about"
          }
          on_error => "no_user_total_usage_bytes"
        }
      }
    }

    if [file_type] != "" {
      mutate {
        replace => {
          "fn" => "%{file_name}"
        }
        on_error => "no_file_name"
      }
      mutate {
        replace => {
          "_security_result.action_details" => "%{content_action}"
        }
        on_error => "no_content_action"
      }
      mutate {
        merge => {
          "_target.file.names" => "fn"
        }
        on_error => "no_file_name"
      }
      mutate {
        replace => {
          "ft.value" => "%{file_type}"
          "ft.key" => "file_type"
        }
        on_error => "no_file_type"
      }
      mutate {
        merge => {
          "about.labels" => "ft"
          "about.resource.attribute.labels" => "ft"
        }
        on_error => "no_file_type"
      }
      mutate {
        merge => {
          "event1.idm.read_only_udm.about" => "about"
        }
        on_error => "no_file_type"
      }
    }

    # principal

    # target
    mutate {
      merge => {
        "_target.ip" => "destination_ip"
      }
      on_error => "no_destination_ip"
    }
    if ![no_destination_ip] {
      mutate {
        replace => {
          "has_target_data" => "true"
        }
      }
    }

    mutate {
      replace => {
        "_target.location.country_or_region" => "%{destination_ip_country_name}"
      }
      on_error => "no_destination_ip_country_name"
    }
    # target

    # network
    mutate {
      replace => {
        "_network.http.user_agent" => "%{user_agent}"
      }
      on_error => "no_user_agent"
    }
    mutate {
      convert => {
        "user_agent" => "parseduseragent"
      }
      on_error => "no_user_agent"
    }
    if ![no_user_agent] {
      mutate {
        rename => {
          "user_agent" => "_network.http.parsed_user_agent"
        }
      }
    }

    mutate {
      replace => {
        "_network.http.referral_url" => "%{referer_url}"
      }
      on_error => "no_referer_url"
    }

    if [request_method] != "" {
      mutate {
        replace => {
          "_network.http.method" => "%{request_method}"
        }
        on_error => "no_request_method"
      }
    }

    mutate {
      convert => {
        "total_bytes" => "uinteger"
      }
      on_error => "_no_total_bytes"
    }

    if ![_no_total_bytes] and [total_bytes] > 0 {
      mutate {
        rename => {
          "total_bytes" => "_network.received_bytes"
        }
      }
    }

    mutate {
      convert => {
        "response_status_code" => "integer"
      }
      on_error => "_no_response_status_code"
    }

    if ![_no_response_status_code] {
      mutate {
        rename => {
          "response_status_code" => "_network.http.response_code"
        }
      }
    }

    # intermediary
    if [data][properties][hostname][str] != "" {
      mutate {
        rename => {
          "data.properties.hostname.str" => "_intermediary.hostname"
        }
        on_error => "no_hostname_environment"
      }
    }
    else if [properties][hostname] != "" {
      mutate {
        rename => {
          "properties.hostname" => "_intermediary.hostname"
        }
        on_error => "no_hostname_environment"
      }
    }
    if [data][properties][environment][str] != "" {
      mutate {
        rename => {
          "data.properties.environment.str" => "_intermediary.location.name"
        }
        on_error => "no_hostname_environment"
      }
    }
    else if [properties][environment] != "" {
      mutate {
        rename => {
          "properties.environment" => "_intermediary.location.name"
        }
        on_error => "no_hostname_environment"
      }
    }

    # security result
    mutate {
      replace => {
        "_security_result.rule_id" => "%{rule_id}"
      }
      on_error => "no_rule_id"
    }

    mutate {
      rename => {
        "rule_name_at_log_time" => "_security_result.rule_name"
      }
      on_error => "no_rule_name_and_rule_type"
    }
    mutate {
      rename => {
        "rule_type" => "_security_result.rule_type"
      }
      on_error => "no_rule_name_and_rule_type"
    }

    mutate {
      replace => {
        "_security_result.summary" => "Action: %{action}, Action reason: %{action_reason}"
      }
      on_error => "no_action_reason"
    }

    mutate {
      convert => {
        "policy_version" => "string"
      }
      on_error => "_no_policy_version"
    }
    if ![_no_policy_version] {
      mutate {
        rename => {
          "policy_version" => "_security_result.rule_version"
        }
      }
    }

    if ([data][level] == "INFO") or ([level] == "INFO") {
      mutate {
        replace => {
          "_security_result.severity" => "INFORMATIONAL"
        }
      }
    }
    else if ([data][level] == "LOW") or ([level] == "LOW") {
      mutate {
        replace => {
          "_security_result.severity" => "LOW"
        }
      }
    }
    else if ([data][level] == "HIGH") or ([level] == "HIGH") {
      mutate {
        replace => {
          "_security_result.severity" => "HIGH"
        }
      }
    }
    if [has_principal_data] == "true" and [has_target_data] == "true" {
      mutate {
        replace => {
          "_metadata.event_type" => "NETWORK_HTTP"
        }
        on_error => "no_event_type_NETWORK_HTTP"
      }
    }
    else {
      mutate {
        replace => {
          "_metadata.event_type" => "GENERIC_EVENT"
        }
      }
    }
  }

  # DEVICE MESSAGE
  else if [event_type] != "" and [device] != "" {
    mutate {
      replace => {
        "_metadata.event_type" => "GENERIC_EVENT"
      }
    }
    mutate {
      replace => {
        "_metadata.product_event_type" => "%{type}"
      }
      on_error => "no_type"
    }
    mutate {
      replace => {
        "_metadata.product_log_id" => "%{traceId}"
      }
      on_error => "no_traceId"
    }
    mutate {
      replace => {
        "_target.asset.product_object_id" => "%{device.identifier}"
      }
      on_error => "no_device_identifier"
    }
    mutate {
      replace => {
        "_target.asset.asset_id" => "UDID:%{device.udid}"
      }
      on_error => "no_device_udid"
    }
    mutate {
      replace => {
        "_target.asset.platform_software.platform_version" => "%{device.os_version}"
      }
      on_error => "no_os_version"
    }
    mutate {
      replace => {
        "_target.user.user_display_name" => "%{device.user.name}"
      }
      on_error => "no_user_name"
    }
    mutate {
      replace => {
        "_hardware.serial_number" => "%{device.serial_number}"
      }
      on_error => "no_serial_number"
    }
    mutate {
      replace => {
        "_hardware.model" => "%{device.model}"
        "_security_result.summary" => "%{sub_type}"
      }
      on_error => "no_model"
    }
    mutate {
      replace => {
        "_security_result.summary" => "%{sub_type}"
      }
      on_error => "no_sub_type"
    }

    mutate {
      gsub => ["timestamp", "T", " "]
    }
    mutate {
      gsub => ["timestamp", "\\+(\\d{2}):(\\d{2})", " +$1$2"]
    }

    date {
      match => ["timestamp", "yyyy-MM-dd HH:mm:ss.SSS Z"]
      on_error => "invalid_date_format"
    }

    mutate {
      convert => {
        "device.user.id" => "string"
      }
      on_error => "already_a_string"
    }
    mutate {
      convert => {
        "device.user.organization.id" => "string"
      }
      on_error => "already_a_string"
    }
    mutate {
      convert => {
        "id" => "string"
      }
      on_error => "already_a_string"
    }
    mutate {
      replace => {
        "_target.user.userid" => "%{device.user.id}"
      }
      on_error => "no_device_user_id"
    }
    mutate {
      replace => {
        "_target.user.groupid" => "%{device.user.organization.id}"
      }
      on_error => "no_device_organization_id"
    }
    mutate {
      replace => {
        "_metadata.product_log_id" => "%{id}"
      }
      on_error => "no_id"
    }

    mutate {
      merge => {
        "_target.user.group_identifiers" => "device.user.organization.name"
      }
      on_error => "no_organization_name"
    }
    mutate {
      merge => {
        "_target.user.email_addresses" => "device.user.email"
      }
      on_error => "no_user_email"
    }
    mutate {
      merge => {
        "_target.asset.hardware" => "_hardware"
      }
      on_error => "no_hardware"
    }

    mutate {
      rename => {
        "device.current_risk_warnings" => "_security_result.category_details"
      }
    }

    if [device][model] =~ "(?i)ip(ad|hone)" {
      mutate {
        replace => {
          "_target.asset.type" => "MOBILE"
          "_target.asset.platform_software.platform" => "MAC"
        }
      }
    }

    if [severity] == "low" {
      mutate {
        replace => {
          "_security_result.severity" => "LOW"
        }
      }
    }
    else if [severity] == "medium" {
      mutate {
        replace => {
          "_security_result.severity" => "MEDIUM"
        }
      }
    }
    else if [severity] == "high" {
      mutate {
        replace => {
          "_security_result.severity" => "HIGH"
        }
      }
    }
  }

  if [url] != ""{
    grok {
      match => {
        "url" => "https://.*user/%{WORD:userid}/.*"
      }
      overwrite => ["userid"]
      on_error => "no_userid"
    }
    if ![no_userid] and [userid] != "" {
      mutate {
        replace => {
          "_target.user.userid" => "%{userid}"
        }
        on_error => "no_userid2"
      }
    }
  }

  ## merging
  if [_metadata] != ""{
    mutate {
      rename => {
        "_metadata" => "event1.idm.read_only_udm.metadata"
      }
    }
  }
  if [_principal] != ""{
    mutate {
      rename => {
        "_principal" => "event1.idm.read_only_udm.principal"
      }
    }
  }
  if [_target] != "" {
    mutate {
      rename => {
        "_target" => "event1.idm.read_only_udm.target"
      }
    }
  }
  if [_network] != "" {
    mutate {
      rename => {
        "_network" => "event1.idm.read_only_udm.network"
      }
    }
  }
  if [_intermediary] != "" {
    mutate {
      merge => {
        "event1.idm.read_only_udm.intermediary" => "_intermediary"
      }
    }
  }
  if [_security_result] != "" {
    mutate {
      merge => {
        "event1.idm.read_only_udm.security_result" => "_security_result"
      }
    }
  }
  ## merging

  mutate {
    merge => {
      "@output" => "event1"
    }
  }
}

