# Product: MANAGE_ENGINE_PAM360
# Category: tokens, phones, groups, and endpoints
# Supported Format: SYSLOG
# Reference: NA
# Last Updated: 2026-06-16
# Copyright 2026 Google SecOps

filter {
  mutate {
    replace => {
      "security_result" => ""
      "syslog_priority" => ""
      "syslog_timestamp" => ""
      "principal_ip" => ""
      "prod_event_type" => ""
      "date_data" => ""
      "time_data" => ""
      "action_details" => ""
      "target_host" => ""
      "target_user" => ""
      "desc_data" => ""
      "event_desc" => ""
      "principal_user" => ""
      "principal_host" => ""
      "target_machine" => ""
      "source_audit_host" => ""
      "principal_machine" => ""
      "summary_detail" => ""
      "group_details" => ""
      "target_file" => ""
      "target_ip" => ""
      "target_data" => ""
      "domain_name" => ""
      "target_user1" => ""
      "has_target_file" => "false"
      "has_principal" => "false"
      "has_target" => "false"
      "has_principal_user" => "false"
      "has_target_user" => "false"
    }
  }
  mutate {
    gsub => ["message", "\\n", ""]
  }
  grok {
    match => {
      "message" => [
        "<%{INT:syslog_priority}>%{SYSLOGTIMESTAMP:syslog_timestamp} %{DATA} %{WORD:prod_event_type}:%{DATA:principal_user}:%{DATA:source_audit_host} %{DATA:event_desc} %{DATA:date_data} %{DATA:time_data} %{DATA:action_details} %{DATA:principal_machine} %{IPORHOST:target_machine}:%{DATA:target_user}:%{DATA:group_details}:%{GREEDYDATA:desc_data}",
        "<%{INT:syslog_priority}>%{SYSLOGTIMESTAMP:syslog_timestamp} %{DATA} %{WORD:prod_event_type}:%{DATA:principal_user}:%{DATA:principal_machine} (?<event_desc>User_Group_Added) %{DATA:date_data} %{DATA:time_data} %{DATA:action_details} %{DATA:principal_host} -%{DATA:group_details}:%{GREEDYDATA:desc_data}",
        "<%{INT:syslog_priority}>%{SYSLOGTIMESTAMP:syslog_timestamp} %{DATA} %{WORD:prod_event_type}:%{DATA:principal_user}:%{DATA:principal_machine} (?<event_desc>General_setting_changed|User_Logged_Out|User_Personal_Data_Viewed|Personal_setting_changed) %{DATA:date_data} %{DATA:time_data} %{DATA:action_details} %{DATA:target_host} -%{DATA:target_user}:%{GREEDYDATA:desc_data}",
        "<%{INT:syslog_priority}>%{SYSLOGTIMESTAMP:syslog_timestamp} %{DATA} %{WORD:prod_event_type}:%{DATA:principal_user}:%{DATA:source_audit_host} (?<event_desc>User_Group_Modified) %{DATA:date_data} %{DATA:time_data} %{DATA:action_details} %{DATA:target_host} -((?<group_details>%{DATA}_\\(Group_Name\\))|%{DATA:target_user}):%{GREEDYDATA:desc_data}",
        "<%{INT:syslog_priority}>%{SYSLOGTIMESTAMP:syslog_timestamp} %{DATA} %{WORD:prod_event_type}:%{DATA:principal_user}:%{DATA:source_audit_host} %{DATA:event_desc} %{DATA:date_data} %{DATA:time_data} %{DATA:action_details} %{DATA:target_host} -%{DATA:target_user}:%{GREEDYDATA:desc_data}",
        "<%{INT:syslog_priority}>%{SYSLOGTIMESTAMP:syslog_timestamp} %{DATA} %{WORD:prod_event_type}:%{DATA:principal_user}:%{DATA:source_audit_host} (?<event_desc>Account_Discovery_Failed|Account_Discovery) %{DATA:date_data} %{DATA:time_data} %{WORD:action_details} %{DATA:principal_machine} %{DATA:target_machine}:%{DATA:target_user}:%{DATA:group_details}:%{GREEDYDATA:desc_data}",
        "<%{INT:syslog_priority}>%{SYSLOGTIMESTAMP:syslog_timestamp} %{DATA} %{WORD:prod_event_type}:%{DATA:principal_user}:%{DATA:source_audit_host} (?<event_desc>Resource_Enabled) %{DATA:date_data} %{DATA:time_data} %{DATA:action_details} %{DATA:principal_host} %{DATA:target_machine}:%{GREEDYDATA:desc_data}",
        "<%{INT:syslog_priority}>%{SYSLOGTIMESTAMP:syslog_timestamp} %{DATA} %{WORD:prod_event_type}:%{DATA:principal_user}:%{DATA:source_audit_host} (?<event_desc>Resource_Group_Modified) %{DATA:date_data} %{DATA:time_data} %{DATA:action_details} %{DATA:principal_host} %{DATA:group_details}:%{DATA}:%{DATA}:%{GREEDYDATA:desc_data}",
        "<%{INT:syslog_priority}>%{SYSLOGTIMESTAMP:syslog_timestamp} %{DATA} %{WORD:prod_event_type}:%{DATA:principal_user}:%{DATA:source_audit_host} %{DATA:event_desc} %{DATA:date_data} %{DATA:time_data} %{DATA:action_details} %{DATA:principal_host} %{DATA:summary_detail}:%{DATA:target_user}:%{DATA:group_details}:%{GREEDYDATA:desc_data}",
        "<%{INT:syslog_priority}>%{SYSLOGTIMESTAMP:syslog_timestamp} %{DATA} %{WORD:prod_event_type}:%{DATA:principal_user}:%{DATA:source_audit_host} %{DATA:event_desc} %{DATA:date_data} %{DATA:time_data} %{DATA:action_details} %{DATA:principal_machine} %{DATA:target_data}:%{GREEDYDATA:desc_data}\\|"
      ]
    }
    overwrite => ["source_audit_host","event_desc","syslog_priority", "syslog_timestamp", "principal_ip", "prod_event_type", "date_data", "time_data", "action_details", "target_host", "target_user", "desc_data","principal_user", "target_machine","principal_host","principal_machine","summary_detail","group_details","target_data"]
    on_error => "grok_message_error"
  }
  if [grok_message_error] {
    drop {
      tag => "TAG_MALFORMED_MESSAGE"
    }
  }
  mutate {
    replace => {
      "time_data" => "%{date_data} %{time_data}"
    }
    on_error => "time_data_replace_error"
  }
  if [time_data] != "" {
    date {
      match => ["time_data", "yyyy/MM/dd HH:mm:ss"]
      target => "event.idm.read_only_udm.metadata.event_timestamp"
      on_error => "time_data_match_error"
    }
  }
  if [syslog_timestamp] != "" {
    date {
      match => ["syslog_timestamp", "MMM d HH:mm:ss"]
      rebase => true
      target => "event.idm.read_only_udm.metadata.collected_timestamp"
      on_error => "syslog_timestamp_match_error"
    }
  }
  if [summary_detail] not in ["", "N/A", "Not_Applicable"] {
    mutate {
      replace => {
        "security_result.summary" => "%{summary_detail}"
      }
      on_error => "summary_detail_replace_error"
    }
  }
  if [action_details] != "" {
    mutate {
      replace => {
        "security_result.action_details" => "%{action_details}"
      }
      on_error => "action_details_replace_error"
    }
  }
  if [event_desc] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.description" => "%{event_desc}"
      }
      on_error => "event_desc_replace_error"
    }
  }
  if [prod_event_type] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.product_event_type" => "%{prod_event_type}"
      }
      on_error => "prod_event_type_replace_error"
    }
  }
  if [principal_user] not in ["", "N/A", "Not_Applicable"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.user.userid" => "%{principal_user}"
        "has_principal_user" => "true"
      }
      on_error => "principal_user_replace_error"
    }
  }
  if [source_audit_host] not in ["", "N/A", "Not_Applicable"] {
    grok {
      match => {
        "source_audit_host" => [
          "%{IP:source_audit_host}"
        ]
      }
      overwrite => ["source_audit_host"]
      on_error => "source_audit_host_grok_error"
    }
    if ![source_audit_host_grok_error] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "source_audit_host"
          "event.idm.read_only_udm.principal.asset.ip" => "source_audit_host"
        }
        on_error => "source_audit_host_merge_error"
      }
      if ![source_audit_host_merge_error] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
        }
      }
    }
    else {
      mutate {
        replace => {
          "source_audit_host_label.key" => "source_audit_host"
          "source_audit_host_label.value" => "%{source_audit_host}"
        }
        on_error => "source_audit_host_label_replace_error"
      }
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.resource.attribute.labels" => "source_audit_host_label"
        }
        on_error => "source_audit_host_label_merge_error"
      }
    }
  }
  if [principal_machine] != "" {
    grok {
      match => {
        "principal_machine" => [
          "%{IP:principal_machine}"
        ]
      }
      overwrite => ["principal_machine"]
      on_error => "principal_machine_grok_error"
    }
    if ![principal_machine_grok_error] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "principal_machine"
          "event.idm.read_only_udm.principal.asset.ip" => "principal_machine"
        }
        on_error => "principal_machine_merge_error"
      }
      if ![principal_machine_merge_error] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
        }
      }
    }
    else {
      mutate {
        replace => {
          "event.idm.read_only_udm.principal.hostname" => "%{principal_machine}"
          "event.idm.read_only_udm.principal.asset.hostname" => "%{principal_machine}"
          "has_principal" => "true"
        }
        on_error => "principal_machine_replace_error"
      }
    }
  }
  if [principal_host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.principal.hostname" => "%{principal_host}"
        "event.idm.read_only_udm.principal.asset.hostname" => "%{principal_host}"
        "has_principal" => "true"
      }
      on_error => "principal_host_replace_error"
    }
  }
  if [principal_ip] != "" {
    grok {
      match => {
        "principal_ip" => [
          "%{IP:principal_ip}"
        ]
      }
      overwrite => ["principal_ip"]
      on_error => "principal_ip_grok_error"
    }
    if ![principal_ip_grok_error] {
      mutate {
        merge => {
          "event.idm.read_only_udm.principal.ip" => "principal_ip"
          "event.idm.read_only_udm.principal.asset.ip" => "principal_ip"
        }
        on_error => "principal_ip_merge_error"
      }
      if ![principal_ip_merge_error] {
        mutate {
          replace => {
            "has_principal" => "true"
          }
        }
      }
    }
  }
  if [target_host] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.hostname" => "%{target_host}"
        "event.idm.read_only_udm.target.asset.hostname" => "%{target_host}"
        "has_target" => "true"
      }
      on_error => "target_host_replace_error"
    }
  }
  if [target_machine] != "" {
    grok {
      match => {
        "target_machine" => [
          "%{IP:target_machine}"
        ]
      }
      overwrite => ["target_machine"]
      on_error => "target_machine_grok_error"
    }
    if ![target_machine_grok_error] {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.ip" => "target_machine"
          "event.idm.read_only_udm.target.asset.ip" => "target_machine"
        }
        on_error => "target_machine_merge_error"
      }
      if ![target_machine_merge_error] {
        mutate {
          replace => {
            "has_target" => "true"
          }
        }
      }
    }
    else {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.hostname" => "%{target_machine}"
          "event.idm.read_only_udm.target.asset.hostname" => "%{target_machine}"
          "has_target" => "true"
        }
        on_error => "target_machine_replace_error"
      }
    }
  }
  if [desc_data] not in ["", "N/A"] {
    grok {
      match => {
        "desc_data" => [
          "%{DATA:target_file}_File_Uploaded",
          "Connection/authentication_to_%{IP:target_ip}_failed",
          'User_\\"%{DATA:target_user}\\"%{GREEDYDATA}'
        ]
      }
      overwrite => ["target_file", "target_ip","target_user"]
      on_error => "desc_data_grok_error"
    }
    if [target_file] != "" {
      mutate {
        replace => {
          "event.idm.read_only_udm.target.file.full_path" => "%{target_file}"
          "has_target_file" => "true"
        }
        on_error => "target_file_replace_error"
      }
    }
    mutate {
      replace => {
        "security_result.description" => "%{desc_data}"
      }
      on_error => "desc_data_replace_error"
    }
  }
  if [target_data] != "" {
    grok {
      match => {
        "target_data" => [
          "%{DATA:domain_name}\\\\%{GREEDYDATA:group_details}",
          "Non-MSP-%{GREEDYDATA:target_user}"
        ]
      }
      overwrite => ["target_user", "group_details","domain_name"]
      on_error => "target_data_grok_error"
    }
  }
  if [event_desc] == "Read_Only_Share_Revoked" {
    grok {
      match => {
        "group_details" => [
          "%{DATA:target_user1}\\(%{DATA:domain_name}\\\\%{GREEDYDATA}\\)"
        ]
      }
      overwrite => ["target_user1", "domain_name"]
      on_error => "grok_pattern_not_matched"
    }
  }
  if [target_user] not in ["", "N/A","Not_Applicable"]  {
    grok {
      match => {
        "target_user" => [
          "%{DATA:target_user}\\\\%{GREEDYDATA:group_details}",
        ]
      }
      overwrite => ["target_user", "group_details"]
      on_error => "target_user_grok_error"
    }
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.userid" => "%{target_user}"
        "has_target_user" => "true"
      }
      on_error => "target_user_replace_error"
    }
  }
  else if [target_user1] not in ["", "N/A","Not_Applicable"]  {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.user.userid" => "%{target_user1}"
        "has_target_user" => "true"
      }
      on_error => "target_user1_replace_error"
    }
  }
  if [group_details]  not in ["", "N/A", "Not_Applicable"] {
    mutate {
      merge => {
        "event.idm.read_only_udm.target.user.group_identifiers" => "group_details"
      }
      on_error => "group_details_merge_error"
    }
  }
  if [domain_name] != "" {
    mutate {
      replace => {
        "event.idm.read_only_udm.target.administrative_domain" => "%{domain_name}"
      }
      on_error => "domain_name_replace_error"
    }
  }
  if [target_ip] != "" {
    grok {
      match => {
        "target_ip" => [
          "%{IP:target_ip}"
        ]
      }
      overwrite => ["target_ip"]
      on_error => "target_ip_grok_error"
    }
    if ![target_ip_grok_error] {
      mutate {
        merge => {
          "event.idm.read_only_udm.target.ip" => "target_ip"
          "event.idm.read_only_udm.target.asset.ip" => "target_ip"
        }
        on_error => "target_ip_merge_error"
      }
    }
  }
  mutate {
    convert => {
      "syslog_priority" => "string"
    }
    on_error => "syslog_priority_convert_error"
  }
  if [syslog_priority] != "" {
    mutate {
      replace => {
        "syslog_priority_label.key" => "syslog_priority"
        "syslog_priority_label.value.string_value" => "%{syslog_priority}"
      }
      on_error => "syslog_priority_label_replace_error"
    }
    if ![syslog_priority_label_replace_error] {
      mutate {
        merge => {
          "event.idm.read_only_udm.additional.fields" => "syslog_priority_label"
        }
        on_error => "syslog_priority_label_merge_error"
      }
    }
  }
  if [security_result] != "" {
    mutate {
      merge => {
        "event.idm.read_only_udm.security_result" => "security_result"
      }
      on_error => "security_result_merge_error"
    }
  }
  if ([event_desc] =~ "Password_Changed" or [event_desc] =~ "Password_changed_remotely" or [event_desc] =~ "Password_Requested" or [event_desc] =~ "Password_Change_Failed" or [event_desc] =~ "Password_Change_Dropped") and [has_target_user] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_CHANGE_PASSWORD"
      }
    }
  }
  else if [event_desc] =~ "User_Group_Added" and [has_principal_user] == "true" and ([has_principal] == "true" or [has_target] == "true") {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GROUP_CREATION"
      }
    }
  }
  else if [event_desc] =~ "User_Group_Modified" and [has_principal_user] == "true" and ([has_principal] == "true" or [has_target] == "true") {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GROUP_MODIFICATION"
      }
    }
  }
  else if [event_desc] =~ "Account_Deleted" and [has_target_user] == "true" and ([has_principal] == "true" or [has_target] == "true") {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_DELETION"
      }
    }
  }
  else if [event_desc] =~ "Account_Added" and [has_target_user] == "true" and ([has_principal] == "true" or [has_target] == "true") {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_CREATION"
      }
    }
  }
  else if [has_principal] == "true" and [has_target_file] == "true" and [event_desc] == "File_Uploaded" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "FILE_CREATION"
      }
    }
  }
  else if [has_target_user] == "true" and [event_desc] in ["User_Modified", "Read_and_Modify_Share_Given", "Read_Only_Share_Given", "Read_Only_Share_Revoked"] {
    mutate {
      replace => {
        "event.idm.read_only_udm.extensions.auth.auth_details" => "AUTHTYPE_UNSPECIFIED"
        "event.idm.read_only_udm.metadata.event_type" => "USER_CHANGE_PERMISSIONS"
      }
    }
  }
  else if [has_target_user] == "true" and [event_desc] =~ "User_Logged_Out" {
    mutate {
      replace => {
        "event.idm.read_only_udm.extensions.auth.auth_details" => "AUTHTYPE_UNSPECIFIED"
        "event.idm.read_only_udm.metadata.event_type" => "USER_LOGOUT"
      }
    }
  }
  else if [has_target_user] == "true" and [event_desc] !~ "User_Personal_Data_Viewed" {
    mutate {
      replace => {
        "event.idm.read_only_udm.extensions.auth.auth_details" => "AUTHTYPE_UNSPECIFIED"
        "event.idm.read_only_udm.metadata.event_type" => "USER_LOGIN"
      }
    }
  }
  else if [event_desc] =~ "General_setting_changed" and [has_principal_user] == "true" and [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "SETTING_MODIFICATION"
        "event.idm.read_only_udm.target.resource.resource_type" => "SETTING"
      }
    }
  }
  else if [has_principal] == "true" and [has_principal_user] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "USER_UNCATEGORIZED"
      }
    }
  }
  else if [has_principal] == "true" and [has_target] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "NETWORK_CONNECTION"
      }
    }
  }
  else if [has_principal] == "true" {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "STATUS_UPDATE"
      }
    }
  }
  else {
    mutate {
      replace => {
        "event.idm.read_only_udm.metadata.event_type" => "GENERIC_EVENT"
      }
    }
  }
  mutate {
    replace => {
      "event.idm.read_only_udm.metadata.vendor_name" => "MANAGE_ENGINE_PAM360"
      "event.idm.read_only_udm.metadata.product_name" => "MANAGE_ENGINE_PAM360"
    }
  }
  mutate {
    merge => {
      "@output" => "event"
    }
  }
}
